GopalSaraf/Practicals/PSDL/include/proc/pic18f67j94.inc
// Register: ADCBUF8L
#define ADCBUF8L ADCBUF8L
ADCBUF8L                                 equ 0E56h
// bitfield definitions
ADCBUF8L_ADCBUF8L_POSN                   equ 0000h
ADCBUF8L_ADCBUF8L_POSITION               equ 0000h
ADCBUF8L_ADCBUF8L_SIZE                   equ 0008h
ADCBUF8L_ADCBUF8L_LENGTH                 equ 0008h
ADCBUF8L_ADCBUF8L_MASK                   equ 00FFh

// Register: ADCBUF8H
#define ADCBUF8H ADCBUF8H
ADCBUF8H                                 equ 0E57h
// bitfield definitions
ADCBUF8H_ADCBUF8H_POSN                   equ 0000h
ADCBUF8H_ADCBUF8H_POSITION               equ 0000h
ADCBUF8H_ADCBUF8H_SIZE                   equ 0008h
ADCBUF8H_ADCBUF8H_LENGTH                 equ 0008h
ADCBUF8H_ADCBUF8H_MASK                   equ 00FFh

// Register: ADCBUF9
#define ADCBUF9 ADCBUF9
ADCBUF9                                  equ 0E58h

// Register: ADCBUF9L
#define ADCBUF9L ADCBUF9L
ADCBUF9L                                 equ 0E58h
// bitfield definitions
ADCBUF9L_ADCBUF9L_POSN                   equ 0000h
ADCBUF9L_ADCBUF9L_POSITION               equ 0000h
ADCBUF9L_ADCBUF9L_SIZE                   equ 0008h
ADCBUF9L_ADCBUF9L_LENGTH                 equ 0008h
ADCBUF9L_ADCBUF9L_MASK                   equ 00FFh

// Register: ADCBUF9H
#define ADCBUF9H ADCBUF9H
ADCBUF9H                                 equ 0E59h
// bitfield definitions
ADCBUF9H_ADCBUF9H_POSN                   equ 0000h
ADCBUF9H_ADCBUF9H_POSITION               equ 0000h
ADCBUF9H_ADCBUF9H_SIZE                   equ 0008h
ADCBUF9H_ADCBUF9H_LENGTH                 equ 0008h
ADCBUF9H_ADCBUF9H_MASK                   equ 00FFh

// Register: ADCBUF10
#define ADCBUF10 ADCBUF10
ADCBUF10                                 equ 0E5Ah

// Register: ADCBUF10L
#define ADCBUF10L ADCBUF10L
ADCBUF10L                                equ 0E5Ah
// bitfield definitions
ADCBUF10L_ADCBUF10L_POSN                 equ 0000h
ADCBUF10L_ADCBUF10L_POSITION             equ 0000h
ADCBUF10L_ADCBUF10L_SIZE                 equ 0008h
ADCBUF10L_ADCBUF10L_LENGTH               equ 0008h
ADCBUF10L_ADCBUF10L_MASK                 equ 00FFh

// Register: ADCBUF10H
#define ADCBUF10H ADCBUF10H
ADCBUF10H                                equ 0E5Bh
// bitfield definitions
ADCBUF10H_ADCBUF10H_POSN                 equ 0000h
ADCBUF10H_ADCBUF10H_POSITION             equ 0000h
ADCBUF10H_ADCBUF10H_SIZE                 equ 0008h
ADCBUF10H_ADCBUF10H_LENGTH               equ 0008h
ADCBUF10H_ADCBUF10H_MASK                 equ 00FFh

// Register: ADCBUF11
#define ADCBUF11 ADCBUF11
ADCBUF11                                 equ 0E5Ch

// Register: ADCBUF11L
#define ADCBUF11L ADCBUF11L
ADCBUF11L                                equ 0E5Ch
// bitfield definitions
ADCBUF11L_ADCBUF11L_POSN                 equ 0000h
ADCBUF11L_ADCBUF11L_POSITION             equ 0000h
ADCBUF11L_ADCBUF11L_SIZE                 equ 0008h
ADCBUF11L_ADCBUF11L_LENGTH               equ 0008h
ADCBUF11L_ADCBUF11L_MASK                 equ 00FFh

// Register: ADCBUF11H
#define ADCBUF11H ADCBUF11H
ADCBUF11H                                equ 0E5Dh
// bitfield definitions
ADCBUF11H_ADCBUF11H_POSN                 equ 0000h
ADCBUF11H_ADCBUF11H_POSITION             equ 0000h
ADCBUF11H_ADCBUF11H_SIZE                 equ 0008h
ADCBUF11H_ADCBUF11H_LENGTH               equ 0008h
ADCBUF11H_ADCBUF11H_MASK                 equ 00FFh

// Register: ADCBUF12
#define ADCBUF12 ADCBUF12
ADCBUF12                                 equ 0E5Eh

// Register: ADCBUF12L
#define ADCBUF12L ADCBUF12L
ADCBUF12L                                equ 0E5Eh
// bitfield definitions
ADCBUF12L_ADCBUF12L_POSN                 equ 0000h
ADCBUF12L_ADCBUF12L_POSITION             equ 0000h
ADCBUF12L_ADCBUF12L_SIZE                 equ 0008h
ADCBUF12L_ADCBUF12L_LENGTH               equ 0008h
ADCBUF12L_ADCBUF12L_MASK                 equ 00FFh

// Register: ADCBUF12H
#define ADCBUF12H ADCBUF12H
ADCBUF12H                                equ 0E5Fh
// bitfield definitions
ADCBUF12H_ADCBUF12H_POSN                 equ 0000h
ADCBUF12H_ADCBUF12H_POSITION             equ 0000h
ADCBUF12H_ADCBUF12H_SIZE                 equ 0008h
ADCBUF12H_ADCBUF12H_LENGTH               equ 0008h
ADCBUF12H_ADCBUF12H_MASK                 equ 00FFh

// Register: ADCBUF13
#define ADCBUF13 ADCBUF13
ADCBUF13                                 equ 0E60h

// Register: ADCBUF13L
#define ADCBUF13L ADCBUF13L
ADCBUF13L                                equ 0E60h
// bitfield definitions
ADCBUF13L_ADCBUF13L_POSN                 equ 0000h
ADCBUF13L_ADCBUF13L_POSITION             equ 0000h
ADCBUF13L_ADCBUF13L_SIZE                 equ 0008h
ADCBUF13L_ADCBUF13L_LENGTH               equ 0008h
ADCBUF13L_ADCBUF13L_MASK                 equ 00FFh

// Register: ADCBUF13H
#define ADCBUF13H ADCBUF13H
ADCBUF13H                                equ 0E61h
// bitfield definitions
ADCBUF13H_ADCBUF13H_POSN                 equ 0000h
ADCBUF13H_ADCBUF13H_POSITION             equ 0000h
ADCBUF13H_ADCBUF13H_SIZE                 equ 0008h
ADCBUF13H_ADCBUF13H_LENGTH               equ 0008h
ADCBUF13H_ADCBUF13H_MASK                 equ 00FFh

// Register: ADCBUF14
#define ADCBUF14 ADCBUF14
ADCBUF14                                 equ 0E62h

// Register: ADCBUF14L
#define ADCBUF14L ADCBUF14L
ADCBUF14L                                equ 0E62h
// bitfield definitions
ADCBUF14L_ADCBUF14L_POSN                 equ 0000h
ADCBUF14L_ADCBUF14L_POSITION             equ 0000h
ADCBUF14L_ADCBUF14L_SIZE                 equ 0008h
ADCBUF14L_ADCBUF14L_LENGTH               equ 0008h
ADCBUF14L_ADCBUF14L_MASK                 equ 00FFh

// Register: ADCBUF14H
#define ADCBUF14H ADCBUF14H
ADCBUF14H                                equ 0E63h
// bitfield definitions
ADCBUF14H_ADCBUF14H_POSN                 equ 0000h
ADCBUF14H_ADCBUF14H_POSITION             equ 0000h
ADCBUF14H_ADCBUF14H_SIZE                 equ 0008h
ADCBUF14H_ADCBUF14H_LENGTH               equ 0008h
ADCBUF14H_ADCBUF14H_MASK                 equ 00FFh

// Register: ADCBUF15
#define ADCBUF15 ADCBUF15
ADCBUF15                                 equ 0E64h

// Register: ADCBUF15L
#define ADCBUF15L ADCBUF15L
ADCBUF15L                                equ 0E64h
// bitfield definitions
ADCBUF15L_ADCBUF15L_POSN                 equ 0000h
ADCBUF15L_ADCBUF15L_POSITION             equ 0000h
ADCBUF15L_ADCBUF15L_SIZE                 equ 0008h
ADCBUF15L_ADCBUF15L_LENGTH               equ 0008h
ADCBUF15L_ADCBUF15L_MASK                 equ 00FFh

// Register: ADCBUF15H
#define ADCBUF15H ADCBUF15H
ADCBUF15H                                equ 0E65h
// bitfield definitions
ADCBUF15H_ADCBUF15H_POSN                 equ 0000h
ADCBUF15H_ADCBUF15H_POSITION             equ 0000h
ADCBUF15H_ADCBUF15H_SIZE                 equ 0008h
ADCBUF15H_ADCBUF15H_LENGTH               equ 0008h
ADCBUF15H_ADCBUF15H_MASK                 equ 00FFh

// Register: ADCBUF16
#define ADCBUF16 ADCBUF16
ADCBUF16                                 equ 0E66h

