GopalSaraf/Practicals/PSDL/include/proc/pic18f67j94.inc
// Register: ADCON5L
#define ADCON5L ADCON5L
ADCON5L                                  equ 0E88h
// bitfield definitions
ADCON5L_CM_POSN                          equ 0000h
ADCON5L_CM_POSITION                      equ 0000h
ADCON5L_CM_SIZE                          equ 0002h
ADCON5L_CM_LENGTH                        equ 0002h
ADCON5L_CM_MASK                          equ 0003h
ADCON5L_WM_POSN                          equ 0002h
ADCON5L_WM_POSITION                      equ 0002h
ADCON5L_WM_SIZE                          equ 0002h
ADCON5L_WM_LENGTH                        equ 0002h
ADCON5L_WM_MASK                          equ 000Ch
ADCON5L_CM0_POSN                         equ 0000h
ADCON5L_CM0_POSITION                     equ 0000h
ADCON5L_CM0_SIZE                         equ 0001h
ADCON5L_CM0_LENGTH                       equ 0001h
ADCON5L_CM0_MASK                         equ 0001h
ADCON5L_CM1_POSN                         equ 0001h
ADCON5L_CM1_POSITION                     equ 0001h
ADCON5L_CM1_SIZE                         equ 0001h
ADCON5L_CM1_LENGTH                       equ 0001h
ADCON5L_CM1_MASK                         equ 0002h
ADCON5L_WM0_POSN                         equ 0002h
ADCON5L_WM0_POSITION                     equ 0002h
ADCON5L_WM0_SIZE                         equ 0001h
ADCON5L_WM0_LENGTH                       equ 0001h
ADCON5L_WM0_MASK                         equ 0004h
ADCON5L_WM1_POSN                         equ 0003h
ADCON5L_WM1_POSITION                     equ 0003h
ADCON5L_WM1_SIZE                         equ 0001h
ADCON5L_WM1_LENGTH                       equ 0001h
ADCON5L_WM1_MASK                         equ 0008h

// Register: ADCON5H
#define ADCON5H ADCON5H
ADCON5H                                  equ 0E89h
// bitfield definitions
ADCON5H_ASINTMD_POSN                     equ 0000h
ADCON5H_ASINTMD_POSITION                 equ 0000h
ADCON5H_ASINTMD_SIZE                     equ 0002h
ADCON5H_ASINTMD_LENGTH                   equ 0002h
ADCON5H_ASINTMD_MASK                     equ 0003h
ADCON5H_CTMUREQ_POSN                     equ 0005h
ADCON5H_CTMUREQ_POSITION                 equ 0005h
ADCON5H_CTMUREQ_SIZE                     equ 0001h
ADCON5H_CTMUREQ_LENGTH                   equ 0001h
ADCON5H_CTMUREQ_MASK                     equ 0020h
ADCON5H_LPENA_POSN                       equ 0006h
ADCON5H_LPENA_POSITION                   equ 0006h
ADCON5H_LPENA_SIZE                       equ 0001h
ADCON5H_LPENA_LENGTH                     equ 0001h
ADCON5H_LPENA_MASK                       equ 0040h
ADCON5H_ASENA_POSN                       equ 0007h
ADCON5H_ASENA_POSITION                   equ 0007h
ADCON5H_ASENA_SIZE                       equ 0001h
ADCON5H_ASENA_LENGTH                     equ 0001h
ADCON5H_ASENA_MASK                       equ 0080h
ADCON5H_ASINTMD0_POSN                    equ 0000h
ADCON5H_ASINTMD0_POSITION                equ 0000h
ADCON5H_ASINTMD0_SIZE                    equ 0001h
ADCON5H_ASINTMD0_LENGTH                  equ 0001h
ADCON5H_ASINTMD0_MASK                    equ 0001h
ADCON5H_ASINTMD1_POSN                    equ 0001h
ADCON5H_ASINTMD1_POSITION                equ 0001h
ADCON5H_ASINTMD1_SIZE                    equ 0001h
ADCON5H_ASINTMD1_LENGTH                  equ 0001h
ADCON5H_ASINTMD1_MASK                    equ 0002h

// Register: ADCON3L
#define ADCON3L ADCON3L
ADCON3L                                  equ 0E8Ah
// bitfield definitions
ADCON3L_ADCS_POSN                        equ 0000h
ADCON3L_ADCS_POSITION                    equ 0000h
ADCON3L_ADCS_SIZE                        equ 0008h
ADCON3L_ADCS_LENGTH                      equ 0008h
ADCON3L_ADCS_MASK                        equ 00FFh
ADCON3L_ADCS0_POSN                       equ 0000h
ADCON3L_ADCS0_POSITION                   equ 0000h
ADCON3L_ADCS0_SIZE                       equ 0001h
ADCON3L_ADCS0_LENGTH                     equ 0001h
ADCON3L_ADCS0_MASK                       equ 0001h
ADCON3L_ADCS1_POSN                       equ 0001h
ADCON3L_ADCS1_POSITION                   equ 0001h
ADCON3L_ADCS1_SIZE                       equ 0001h
ADCON3L_ADCS1_LENGTH                     equ 0001h
ADCON3L_ADCS1_MASK                       equ 0002h
ADCON3L_ADCS2_POSN                       equ 0002h
ADCON3L_ADCS2_POSITION                   equ 0002h
ADCON3L_ADCS2_SIZE                       equ 0001h
ADCON3L_ADCS2_LENGTH                     equ 0001h
ADCON3L_ADCS2_MASK                       equ 0004h
ADCON3L_ADCS3_POSN                       equ 0003h
ADCON3L_ADCS3_POSITION                   equ 0003h
ADCON3L_ADCS3_SIZE                       equ 0001h
ADCON3L_ADCS3_LENGTH                     equ 0001h
ADCON3L_ADCS3_MASK                       equ 0008h
ADCON3L_ADCS4_POSN                       equ 0004h
ADCON3L_ADCS4_POSITION                   equ 0004h
ADCON3L_ADCS4_SIZE                       equ 0001h
ADCON3L_ADCS4_LENGTH                     equ 0001h
ADCON3L_ADCS4_MASK                       equ 0010h
ADCON3L_ADCS5_POSN                       equ 0005h
ADCON3L_ADCS5_POSITION                   equ 0005h
ADCON3L_ADCS5_SIZE                       equ 0001h
ADCON3L_ADCS5_LENGTH                     equ 0001h
ADCON3L_ADCS5_MASK                       equ 0020h
ADCON3L_ADCS6_POSN                       equ 0006h
ADCON3L_ADCS6_POSITION                   equ 0006h
ADCON3L_ADCS6_SIZE                       equ 0001h
ADCON3L_ADCS6_LENGTH                     equ 0001h
ADCON3L_ADCS6_MASK                       equ 0040h
ADCON3L_ADCS7_POSN                       equ 0007h
ADCON3L_ADCS7_POSITION                   equ 0007h
ADCON3L_ADCS7_SIZE                       equ 0001h
ADCON3L_ADCS7_LENGTH                     equ 0001h
ADCON3L_ADCS7_MASK                       equ 0080h

// Register: ADCON3H
#define ADCON3H ADCON3H
ADCON3H                                  equ 0E8Bh
// bitfield definitions
ADCON3H_SAMC_POSN                        equ 0000h
ADCON3H_SAMC_POSITION                    equ 0000h
ADCON3H_SAMC_SIZE                        equ 0005h
ADCON3H_SAMC_LENGTH                      equ 0005h
ADCON3H_SAMC_MASK                        equ 001Fh
ADCON3H_PUMPEN_POSN                      equ 0005h
ADCON3H_PUMPEN_POSITION                  equ 0005h
ADCON3H_PUMPEN_SIZE                      equ 0001h
ADCON3H_PUMPEN_LENGTH                    equ 0001h
ADCON3H_PUMPEN_MASK                      equ 0020h
ADCON3H_EXTSAM_POSN                      equ 0006h
ADCON3H_EXTSAM_POSITION                  equ 0006h
ADCON3H_EXTSAM_SIZE                      equ 0001h
ADCON3H_EXTSAM_LENGTH                    equ 0001h
ADCON3H_EXTSAM_MASK                      equ 0040h
ADCON3H_ADRC_POSN                        equ 0007h
ADCON3H_ADRC_POSITION                    equ 0007h
ADCON3H_ADRC_SIZE                        equ 0001h
ADCON3H_ADRC_LENGTH                      equ 0001h
ADCON3H_ADRC_MASK                        equ 0080h
ADCON3H_SAMC0_POSN                       equ 0000h
ADCON3H_SAMC0_POSITION                   equ 0000h
ADCON3H_SAMC0_SIZE                       equ 0001h
ADCON3H_SAMC0_LENGTH                     equ 0001h
ADCON3H_SAMC0_MASK                       equ 0001h
ADCON3H_SAMC1_POSN                       equ 0001h
ADCON3H_SAMC1_POSITION                   equ 0001h
ADCON3H_SAMC1_SIZE                       equ 0001h
ADCON3H_SAMC1_LENGTH                     equ 0001h
ADCON3H_SAMC1_MASK                       equ 0002h
ADCON3H_SAMC2_POSN                       equ 0002h
ADCON3H_SAMC2_POSITION                   equ 0002h
ADCON3H_SAMC2_SIZE                       equ 0001h
ADCON3H_SAMC2_LENGTH                     equ 0001h
ADCON3H_SAMC2_MASK                       equ 0004h
ADCON3H_SAMC3_POSN                       equ 0003h
ADCON3H_SAMC3_POSITION                   equ 0003h
ADCON3H_SAMC3_SIZE                       equ 0001h
ADCON3H_SAMC3_LENGTH                     equ 0001h
ADCON3H_SAMC3_MASK                       equ 0008h
ADCON3H_SAMC4_POSN                       equ 0004h
ADCON3H_SAMC4_POSITION                   equ 0004h
ADCON3H_SAMC4_SIZE                       equ 0001h
ADCON3H_SAMC4_LENGTH                     equ 0001h
ADCON3H_SAMC4_MASK                       equ 0010h

// Register: ADCON2L
#define ADCON2L ADCON2L
ADCON2L                                  equ 0E8Ch
// bitfield definitions
ADCON2L_ALTS_POSN                        equ 0000h
ADCON2L_ALTS_POSITION                    equ 0000h
ADCON2L_ALTS_SIZE                        equ 0001h
ADCON2L_ALTS_LENGTH                      equ 0001h
ADCON2L_ALTS_MASK                        equ 0001h
ADCON2L_BUFM_POSN                        equ 0001h
ADCON2L_BUFM_POSITION                    equ 0001h
ADCON2L_BUFM_SIZE                        equ 0001h
ADCON2L_BUFM_LENGTH                      equ 0001h
ADCON2L_BUFM_MASK                        equ 0002h
ADCON2L_SMPI_POSN                        equ 0002h
ADCON2L_SMPI_POSITION                    equ 0002h
ADCON2L_SMPI_SIZE                        equ 0005h
ADCON2L_SMPI_LENGTH                      equ 0005h
ADCON2L_SMPI_MASK                        equ 007Ch
ADCON2L_BUFS_POSN                        equ 0007h
ADCON2L_BUFS_POSITION                    equ 0007h
ADCON2L_BUFS_SIZE                        equ 0001h
ADCON2L_BUFS_LENGTH                      equ 0001h
ADCON2L_BUFS_MASK                        equ 0080h
ADCON2L_SMPI0_POSN                       equ 0002h
ADCON2L_SMPI0_POSITION                   equ 0002h
ADCON2L_SMPI0_SIZE                       equ 0001h
ADCON2L_SMPI0_LENGTH                     equ 0001h
ADCON2L_SMPI0_MASK                       equ 0004h
ADCON2L_SMPI1_POSN                       equ 0003h
ADCON2L_SMPI1_POSITION                   equ 0003h
ADCON2L_SMPI1_SIZE                       equ 0001h
ADCON2L_SMPI1_LENGTH                     equ 0001h
ADCON2L_SMPI1_MASK                       equ 0008h
ADCON2L_SMPI2_POSN                       equ 0004h
ADCON2L_SMPI2_POSITION                   equ 0004h
ADCON2L_SMPI2_SIZE                       equ 0001h
ADCON2L_SMPI2_LENGTH                     equ 0001h
ADCON2L_SMPI2_MASK                       equ 0010h
ADCON2L_SMPI3_POSN                       equ 0005h
ADCON2L_SMPI3_POSITION                   equ 0005h
ADCON2L_SMPI3_SIZE                       equ 0001h
ADCON2L_SMPI3_LENGTH                     equ 0001h
ADCON2L_SMPI3_MASK                       equ 0020h
ADCON2L_SMPI4_POSN                       equ 0006h
ADCON2L_SMPI4_POSITION                   equ 0006h
ADCON2L_SMPI4_SIZE                       equ 0001h
ADCON2L_SMPI4_LENGTH                     equ 0001h
ADCON2L_SMPI4_MASK                       equ 0040h

// Register: ADCON2H
#define ADCON2H ADCON2H
ADCON2H                                  equ 0E8Dh
// bitfield definitions
ADCON2H_CSCNA_POSN                       equ 0002h
ADCON2H_CSCNA_POSITION                   equ 0002h
ADCON2H_CSCNA_SIZE                       equ 0001h
ADCON2H_CSCNA_LENGTH                     equ 0001h
ADCON2H_CSCNA_MASK                       equ 0004h
ADCON2H_BUFREGEN_POSN                    equ 0003h
ADCON2H_BUFREGEN_POSITION                equ 0003h
ADCON2H_BUFREGEN_SIZE                    equ 0001h
ADCON2H_BUFREGEN_LENGTH                  equ 0001h
ADCON2H_BUFREGEN_MASK                    equ 0008h
ADCON2H_OFFCAL_POSN                      equ 0004h
ADCON2H_OFFCAL_POSITION                  equ 0004h
ADCON2H_OFFCAL_SIZE                      equ 0001h
ADCON2H_OFFCAL_LENGTH                    equ 0001h
ADCON2H_OFFCAL_MASK                      equ 0010h
ADCON2H_NVCFG0_POSN                      equ 0005h
ADCON2H_NVCFG0_POSITION                  equ 0005h
ADCON2H_NVCFG0_SIZE                      equ 0001h
ADCON2H_NVCFG0_LENGTH                    equ 0001h
ADCON2H_NVCFG0_MASK                      equ 0020h
ADCON2H_PVCFG_POSN                       equ 0006h
ADCON2H_PVCFG_POSITION                   equ 0006h
ADCON2H_PVCFG_SIZE                       equ 0002h
ADCON2H_PVCFG_LENGTH                     equ 0002h
ADCON2H_PVCFG_MASK                       equ 00C0h
ADCON2H_PVCFG0_POSN                      equ 0006h
ADCON2H_PVCFG0_POSITION                  equ 0006h
ADCON2H_PVCFG0_SIZE                      equ 0001h
ADCON2H_PVCFG0_LENGTH                    equ 0001h
ADCON2H_PVCFG0_MASK                      equ 0040h
ADCON2H_PVCFG1_POSN                      equ 0007h
ADCON2H_PVCFG1_POSITION                  equ 0007h
ADCON2H_PVCFG1_SIZE                      equ 0001h
ADCON2H_PVCFG1_LENGTH                    equ 0001h
ADCON2H_PVCFG1_MASK                      equ 0080h

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
LCDDATA0                                 equ 0E8Eh
// bitfield definitions
LCDDATA0_S00C0_POSN                      equ 0000h
LCDDATA0_S00C0_POSITION                  equ 0000h
LCDDATA0_S00C0_SIZE                      equ 0001h
LCDDATA0_S00C0_LENGTH                    equ 0001h
LCDDATA0_S00C0_MASK                      equ 0001h
LCDDATA0_S01C0_POSN                      equ 0001h
LCDDATA0_S01C0_POSITION                  equ 0001h
LCDDATA0_S01C0_SIZE                      equ 0001h
LCDDATA0_S01C0_LENGTH                    equ 0001h
LCDDATA0_S01C0_MASK                      equ 0002h
LCDDATA0_S02C0_POSN                      equ 0002h
LCDDATA0_S02C0_POSITION                  equ 0002h
LCDDATA0_S02C0_SIZE                      equ 0001h
LCDDATA0_S02C0_LENGTH                    equ 0001h
LCDDATA0_S02C0_MASK                      equ 0004h
LCDDATA0_S03C0_POSN                      equ 0003h
LCDDATA0_S03C0_POSITION                  equ 0003h
LCDDATA0_S03C0_SIZE                      equ 0001h
LCDDATA0_S03C0_LENGTH                    equ 0001h
LCDDATA0_S03C0_MASK                      equ 0008h
LCDDATA0_S04C0_POSN                      equ 0004h
LCDDATA0_S04C0_POSITION                  equ 0004h
LCDDATA0_S04C0_SIZE                      equ 0001h
LCDDATA0_S04C0_LENGTH                    equ 0001h
LCDDATA0_S04C0_MASK                      equ 0010h
LCDDATA0_S05C0_POSN                      equ 0005h
LCDDATA0_S05C0_POSITION                  equ 0005h
LCDDATA0_S05C0_SIZE                      equ 0001h
LCDDATA0_S05C0_LENGTH                    equ 0001h
LCDDATA0_S05C0_MASK                      equ 0020h
LCDDATA0_S06C0_POSN                      equ 0006h
LCDDATA0_S06C0_POSITION                  equ 0006h
LCDDATA0_S06C0_SIZE                      equ 0001h
LCDDATA0_S06C0_LENGTH                    equ 0001h
LCDDATA0_S06C0_MASK                      equ 0040h
LCDDATA0_S07C0_POSN                      equ 0007h
LCDDATA0_S07C0_POSITION                  equ 0007h
LCDDATA0_S07C0_SIZE                      equ 0001h
LCDDATA0_S07C0_LENGTH                    equ 0001h
LCDDATA0_S07C0_MASK                      equ 0080h

// Register: LCDDATA1
#define LCDDATA1 LCDDATA1
LCDDATA1                                 equ 0E8Fh
// bitfield definitions
LCDDATA1_S08C0_POSN                      equ 0000h
LCDDATA1_S08C0_POSITION                  equ 0000h
LCDDATA1_S08C0_SIZE                      equ 0001h
LCDDATA1_S08C0_LENGTH                    equ 0001h
LCDDATA1_S08C0_MASK                      equ 0001h
LCDDATA1_S09C0_POSN                      equ 0001h
LCDDATA1_S09C0_POSITION                  equ 0001h
LCDDATA1_S09C0_SIZE                      equ 0001h
LCDDATA1_S09C0_LENGTH                    equ 0001h
LCDDATA1_S09C0_MASK                      equ 0002h
LCDDATA1_S10C0_POSN                      equ 0002h
LCDDATA1_S10C0_POSITION                  equ 0002h
LCDDATA1_S10C0_SIZE                      equ 0001h
LCDDATA1_S10C0_LENGTH                    equ 0001h
LCDDATA1_S10C0_MASK                      equ 0004h
LCDDATA1_S11C0_POSN                      equ 0003h
LCDDATA1_S11C0_POSITION                  equ 0003h
LCDDATA1_S11C0_SIZE                      equ 0001h
LCDDATA1_S11C0_LENGTH                    equ 0001h
LCDDATA1_S11C0_MASK                      equ 0008h
LCDDATA1_S12C0_POSN                      equ 0004h
LCDDATA1_S12C0_POSITION                  equ 0004h
LCDDATA1_S12C0_SIZE                      equ 0001h
LCDDATA1_S12C0_LENGTH                    equ 0001h
LCDDATA1_S12C0_MASK                      equ 0010h
LCDDATA1_S13C0_POSN                      equ 0005h
LCDDATA1_S13C0_POSITION                  equ 0005h
LCDDATA1_S13C0_SIZE                      equ 0001h
LCDDATA1_S13C0_LENGTH                    equ 0001h
LCDDATA1_S13C0_MASK                      equ 0020h
LCDDATA1_S14C0_POSN                      equ 0006h
LCDDATA1_S14C0_POSITION                  equ 0006h
LCDDATA1_S14C0_SIZE                      equ 0001h
LCDDATA1_S14C0_LENGTH                    equ 0001h
LCDDATA1_S14C0_MASK                      equ 0040h
LCDDATA1_S15C0_POSN                      equ 0007h
LCDDATA1_S15C0_POSITION                  equ 0007h
LCDDATA1_S15C0_SIZE                      equ 0001h
LCDDATA1_S15C0_LENGTH                    equ 0001h
LCDDATA1_S15C0_MASK                      equ 0080h

// Register: LCDDATA2
#define LCDDATA2 LCDDATA2
LCDDATA2                                 equ 0E90h
// bitfield definitions
LCDDATA2_S16C0_POSN                      equ 0000h
LCDDATA2_S16C0_POSITION                  equ 0000h
LCDDATA2_S16C0_SIZE                      equ 0001h
LCDDATA2_S16C0_LENGTH                    equ 0001h
LCDDATA2_S16C0_MASK                      equ 0001h
LCDDATA2_S17C0_POSN                      equ 0001h
LCDDATA2_S17C0_POSITION                  equ 0001h
LCDDATA2_S17C0_SIZE                      equ 0001h
LCDDATA2_S17C0_LENGTH                    equ 0001h
LCDDATA2_S17C0_MASK                      equ 0002h
LCDDATA2_S18C0_POSN                      equ 0002h
LCDDATA2_S18C0_POSITION                  equ 0002h
LCDDATA2_S18C0_SIZE                      equ 0001h
LCDDATA2_S18C0_LENGTH                    equ 0001h
LCDDATA2_S18C0_MASK                      equ 0004h
LCDDATA2_S19C0_POSN                      equ 0003h
LCDDATA2_S19C0_POSITION                  equ 0003h
LCDDATA2_S19C0_SIZE                      equ 0001h
LCDDATA2_S19C0_LENGTH                    equ 0001h
LCDDATA2_S19C0_MASK                      equ 0008h
LCDDATA2_S20C0_POSN                      equ 0004h
LCDDATA2_S20C0_POSITION                  equ 0004h
LCDDATA2_S20C0_SIZE                      equ 0001h
LCDDATA2_S20C0_LENGTH                    equ 0001h
LCDDATA2_S20C0_MASK                      equ 0010h
LCDDATA2_S21C0_POSN                      equ 0005h
LCDDATA2_S21C0_POSITION                  equ 0005h
LCDDATA2_S21C0_SIZE                      equ 0001h
LCDDATA2_S21C0_LENGTH                    equ 0001h
LCDDATA2_S21C0_MASK                      equ 0020h
LCDDATA2_S22C0_POSN                      equ 0006h
LCDDATA2_S22C0_POSITION                  equ 0006h
LCDDATA2_S22C0_SIZE                      equ 0001h
LCDDATA2_S22C0_LENGTH                    equ 0001h
LCDDATA2_S22C0_MASK                      equ 0040h
LCDDATA2_S23C0_POSN                      equ 0007h
LCDDATA2_S23C0_POSITION                  equ 0007h
LCDDATA2_S23C0_SIZE                      equ 0001h
LCDDATA2_S23C0_LENGTH                    equ 0001h
LCDDATA2_S23C0_MASK                      equ 0080h

// Register: LCDDATA3
#define LCDDATA3 LCDDATA3
LCDDATA3                                 equ 0E91h
// bitfield definitions
LCDDATA3_S24C0_POSN                      equ 0000h
LCDDATA3_S24C0_POSITION                  equ 0000h
LCDDATA3_S24C0_SIZE                      equ 0001h
LCDDATA3_S24C0_LENGTH                    equ 0001h
LCDDATA3_S24C0_MASK                      equ 0001h
LCDDATA3_S25C0_POSN                      equ 0001h
LCDDATA3_S25C0_POSITION                  equ 0001h
LCDDATA3_S25C0_SIZE                      equ 0001h
LCDDATA3_S25C0_LENGTH                    equ 0001h
LCDDATA3_S25C0_MASK                      equ 0002h
LCDDATA3_S26C0_POSN                      equ 0002h
LCDDATA3_S26C0_POSITION                  equ 0002h
LCDDATA3_S26C0_SIZE                      equ 0001h
LCDDATA3_S26C0_LENGTH                    equ 0001h
LCDDATA3_S26C0_MASK                      equ 0004h
LCDDATA3_S27C0_POSN                      equ 0003h
LCDDATA3_S27C0_POSITION                  equ 0003h
LCDDATA3_S27C0_SIZE                      equ 0001h
LCDDATA3_S27C0_LENGTH                    equ 0001h
LCDDATA3_S27C0_MASK                      equ 0008h
LCDDATA3_S28C0_POSN                      equ 0004h
LCDDATA3_S28C0_POSITION                  equ 0004h
LCDDATA3_S28C0_SIZE                      equ 0001h
LCDDATA3_S28C0_LENGTH                    equ 0001h
LCDDATA3_S28C0_MASK                      equ 0010h
LCDDATA3_S29C0_POSN                      equ 0005h
LCDDATA3_S29C0_POSITION                  equ 0005h
LCDDATA3_S29C0_SIZE                      equ 0001h
LCDDATA3_S29C0_LENGTH                    equ 0001h
LCDDATA3_S29C0_MASK                      equ 0020h
LCDDATA3_S30C0_POSN                      equ 0006h
LCDDATA3_S30C0_POSITION                  equ 0006h
LCDDATA3_S30C0_SIZE                      equ 0001h
LCDDATA3_S30C0_LENGTH                    equ 0001h
LCDDATA3_S30C0_MASK                      equ 0040h
LCDDATA3_S31C0_POSN                      equ 0007h
LCDDATA3_S31C0_POSITION                  equ 0007h
LCDDATA3_S31C0_SIZE                      equ 0001h
LCDDATA3_S31C0_LENGTH                    equ 0001h
LCDDATA3_S31C0_MASK                      equ 0080h

