GopalSaraf/Practicals/PSDL/include/proc/pic18f67j94.inc
// Register: DSWAKEL
#define DSWAKEL DSWAKEL
DSWAKEL                                  equ 0F26h
// bitfield definitions
DSWAKEL_DSPOR_POSN                       equ 0000h
DSWAKEL_DSPOR_POSITION                   equ 0000h
DSWAKEL_DSPOR_SIZE                       equ 0001h
DSWAKEL_DSPOR_LENGTH                     equ 0001h
DSWAKEL_DSPOR_MASK                       equ 0001h
DSWAKEL_DSICD_POSN                       equ 0001h
DSWAKEL_DSICD_POSITION                   equ 0001h
DSWAKEL_DSICD_SIZE                       equ 0001h
DSWAKEL_DSICD_LENGTH                     equ 0001h
DSWAKEL_DSICD_MASK                       equ 0002h
DSWAKEL_DSMCLR_POSN                      equ 0002h
DSWAKEL_DSMCLR_POSITION                  equ 0002h
DSWAKEL_DSMCLR_SIZE                      equ 0001h
DSWAKEL_DSMCLR_LENGTH                    equ 0001h
DSWAKEL_DSMCLR_MASK                      equ 0004h
DSWAKEL_DSRTC_POSN                       equ 0003h
DSWAKEL_DSRTC_POSITION                   equ 0003h
DSWAKEL_DSRTC_SIZE                       equ 0001h
DSWAKEL_DSRTC_LENGTH                     equ 0001h
DSWAKEL_DSRTC_MASK                       equ 0008h
DSWAKEL_DSWDT_POSN                       equ 0004h
DSWAKEL_DSWDT_POSITION                   equ 0004h
DSWAKEL_DSWDT_SIZE                       equ 0001h
DSWAKEL_DSWDT_LENGTH                     equ 0001h
DSWAKEL_DSWDT_MASK                       equ 0010h
DSWAKEL_DSULP_POSN                       equ 0005h
DSWAKEL_DSULP_POSITION                   equ 0005h
DSWAKEL_DSULP_SIZE                       equ 0001h
DSWAKEL_DSULP_LENGTH                     equ 0001h
DSWAKEL_DSULP_MASK                       equ 0020h
DSWAKEL_BOR_POSN                         equ 0006h
DSWAKEL_BOR_POSITION                     equ 0006h
DSWAKEL_BOR_SIZE                         equ 0001h
DSWAKEL_BOR_LENGTH                       equ 0001h
DSWAKEL_BOR_MASK                         equ 0040h
DSWAKEL_DSFLT_POSN                       equ 0007h
DSWAKEL_DSFLT_POSITION                   equ 0007h
DSWAKEL_DSFLT_SIZE                       equ 0001h
DSWAKEL_DSFLT_LENGTH                     equ 0001h
DSWAKEL_DSFLT_MASK                       equ 0080h

// Register: DSCONH
#define DSCONH DSCONH
DSCONH                                   equ 0F27h
// bitfield definitions
DSCONH_RTCWDIS_POSN                      equ 0000h
DSCONH_RTCWDIS_POSITION                  equ 0000h
DSCONH_RTCWDIS_SIZE                      equ 0001h
DSCONH_RTCWDIS_LENGTH                    equ 0001h
DSCONH_RTCWDIS_MASK                      equ 0001h
DSCONH_DSEN_POSN                         equ 0007h
DSCONH_DSEN_POSITION                     equ 0007h
DSCONH_DSEN_SIZE                         equ 0001h
DSCONH_DSEN_LENGTH                       equ 0001h
DSCONH_DSEN_MASK                         equ 0080h

// Register: DSCONL
#define DSCONL DSCONL
DSCONL                                   equ 0F28h
// bitfield definitions
DSCONL_RELEASE_POSN                      equ 0000h
DSCONL_RELEASE_POSITION                  equ 0000h
DSCONL_RELEASE_SIZE                      equ 0001h
DSCONL_RELEASE_LENGTH                    equ 0001h
DSCONL_RELEASE_MASK                      equ 0001h
DSCONL_DSBOR_POSN                        equ 0001h
DSCONL_DSBOR_POSITION                    equ 0001h
DSCONL_DSBOR_SIZE                        equ 0001h
DSCONL_DSBOR_LENGTH                      equ 0001h
DSCONL_DSBOR_MASK                        equ 0002h
DSCONL_ULPWDIS_POSN                      equ 0002h
DSCONL_ULPWDIS_POSITION                  equ 0002h
DSCONL_ULPWDIS_SIZE                      equ 0001h
DSCONL_ULPWDIS_LENGTH                    equ 0001h
DSCONL_ULPWDIS_MASK                      equ 0004h

// Register: TXREG3
#define TXREG3 TXREG3
TXREG3                                   equ 0F29h
// bitfield definitions
TXREG3_TXREG3_POSN                       equ 0000h
TXREG3_TXREG3_POSITION                   equ 0000h
TXREG3_TXREG3_SIZE                       equ 0008h
TXREG3_TXREG3_LENGTH                     equ 0008h
TXREG3_TXREG3_MASK                       equ 00FFh

// Register: RCREG3
#define RCREG3 RCREG3
RCREG3                                   equ 0F2Ah
// bitfield definitions
RCREG3_RCREG3_POSN                       equ 0000h
RCREG3_RCREG3_POSITION                   equ 0000h
RCREG3_RCREG3_SIZE                       equ 0008h
RCREG3_RCREG3_LENGTH                     equ 0008h
RCREG3_RCREG3_MASK                       equ 00FFh

// Register: SPBRG3
#define SPBRG3 SPBRG3
SPBRG3                                   equ 0F2Bh
// bitfield definitions
SPBRG3_SPBRG3_POSN                       equ 0000h
SPBRG3_SPBRG3_POSITION                   equ 0000h
SPBRG3_SPBRG3_SIZE                       equ 0008h
SPBRG3_SPBRG3_LENGTH                     equ 0008h
SPBRG3_SPBRG3_MASK                       equ 00FFh
SPBRG3_BRG0_POSN                         equ 0000h
SPBRG3_BRG0_POSITION                     equ 0000h
SPBRG3_BRG0_SIZE                         equ 0001h
SPBRG3_BRG0_LENGTH                       equ 0001h
SPBRG3_BRG0_MASK                         equ 0001h
SPBRG3_BRG1_POSN                         equ 0001h
SPBRG3_BRG1_POSITION                     equ 0001h
SPBRG3_BRG1_SIZE                         equ 0001h
SPBRG3_BRG1_LENGTH                       equ 0001h
SPBRG3_BRG1_MASK                         equ 0002h
SPBRG3_BRG2_POSN                         equ 0002h
SPBRG3_BRG2_POSITION                     equ 0002h
SPBRG3_BRG2_SIZE                         equ 0001h
SPBRG3_BRG2_LENGTH                       equ 0001h
SPBRG3_BRG2_MASK                         equ 0004h
SPBRG3_BRG3_POSN                         equ 0003h
SPBRG3_BRG3_POSITION                     equ 0003h
SPBRG3_BRG3_SIZE                         equ 0001h
SPBRG3_BRG3_LENGTH                       equ 0001h
SPBRG3_BRG3_MASK                         equ 0008h
SPBRG3_BRG4_POSN                         equ 0004h
SPBRG3_BRG4_POSITION                     equ 0004h
SPBRG3_BRG4_SIZE                         equ 0001h
SPBRG3_BRG4_LENGTH                       equ 0001h
SPBRG3_BRG4_MASK                         equ 0010h
SPBRG3_BRG5_POSN                         equ 0005h
SPBRG3_BRG5_POSITION                     equ 0005h
SPBRG3_BRG5_SIZE                         equ 0001h
SPBRG3_BRG5_LENGTH                       equ 0001h
SPBRG3_BRG5_MASK                         equ 0020h
SPBRG3_BRG6_POSN                         equ 0006h
SPBRG3_BRG6_POSITION                     equ 0006h
SPBRG3_BRG6_SIZE                         equ 0001h
SPBRG3_BRG6_LENGTH                       equ 0001h
SPBRG3_BRG6_MASK                         equ 0040h
SPBRG3_BRG7_POSN                         equ 0007h
SPBRG3_BRG7_POSITION                     equ 0007h
SPBRG3_BRG7_SIZE                         equ 0001h
SPBRG3_BRG7_LENGTH                       equ 0001h
SPBRG3_BRG7_MASK                         equ 0080h

// Register: SPBRGH3
#define SPBRGH3 SPBRGH3
SPBRGH3                                  equ 0F2Ch
// bitfield definitions
SPBRGH3_SPBRGH3_POSN                     equ 0000h
SPBRGH3_SPBRGH3_POSITION                 equ 0000h
SPBRGH3_SPBRGH3_SIZE                     equ 0008h
SPBRGH3_SPBRGH3_LENGTH                   equ 0008h
SPBRGH3_SPBRGH3_MASK                     equ 00FFh
SPBRGH3_BRG8_POSN                        equ 0000h
SPBRGH3_BRG8_POSITION                    equ 0000h
SPBRGH3_BRG8_SIZE                        equ 0001h
SPBRGH3_BRG8_LENGTH                      equ 0001h
SPBRGH3_BRG8_MASK                        equ 0001h
SPBRGH3_BRG9_POSN                        equ 0001h
SPBRGH3_BRG9_POSITION                    equ 0001h
SPBRGH3_BRG9_SIZE                        equ 0001h
SPBRGH3_BRG9_LENGTH                      equ 0001h
SPBRGH3_BRG9_MASK                        equ 0002h
SPBRGH3_BRG10_POSN                       equ 0002h
SPBRGH3_BRG10_POSITION                   equ 0002h
SPBRGH3_BRG10_SIZE                       equ 0001h
SPBRGH3_BRG10_LENGTH                     equ 0001h
SPBRGH3_BRG10_MASK                       equ 0004h
SPBRGH3_BRG11_POSN                       equ 0003h
SPBRGH3_BRG11_POSITION                   equ 0003h
SPBRGH3_BRG11_SIZE                       equ 0001h
SPBRGH3_BRG11_LENGTH                     equ 0001h
SPBRGH3_BRG11_MASK                       equ 0008h
SPBRGH3_BRG12_POSN                       equ 0004h
SPBRGH3_BRG12_POSITION                   equ 0004h
SPBRGH3_BRG12_SIZE                       equ 0001h
SPBRGH3_BRG12_LENGTH                     equ 0001h
SPBRGH3_BRG12_MASK                       equ 0010h
SPBRGH3_BRG13_POSN                       equ 0005h
SPBRGH3_BRG13_POSITION                   equ 0005h
SPBRGH3_BRG13_SIZE                       equ 0001h
SPBRGH3_BRG13_LENGTH                     equ 0001h
SPBRGH3_BRG13_MASK                       equ 0020h
SPBRGH3_BRG14_POSN                       equ 0006h
SPBRGH3_BRG14_POSITION                   equ 0006h
SPBRGH3_BRG14_SIZE                       equ 0001h
SPBRGH3_BRG14_LENGTH                     equ 0001h
SPBRGH3_BRG14_MASK                       equ 0040h
SPBRGH3_BRG15_POSN                       equ 0007h
SPBRGH3_BRG15_POSITION                   equ 0007h
SPBRGH3_BRG15_SIZE                       equ 0001h
SPBRGH3_BRG15_LENGTH                     equ 0001h
SPBRGH3_BRG15_MASK                       equ 0080h

// Register: BAUDCON3
#define BAUDCON3 BAUDCON3
BAUDCON3                                 equ 0F2Dh
// bitfield definitions
BAUDCON3_ABDEN_POSN                      equ 0000h
BAUDCON3_ABDEN_POSITION                  equ 0000h
BAUDCON3_ABDEN_SIZE                      equ 0001h
BAUDCON3_ABDEN_LENGTH                    equ 0001h
BAUDCON3_ABDEN_MASK                      equ 0001h
BAUDCON3_WUE_POSN                        equ 0001h
BAUDCON3_WUE_POSITION                    equ 0001h
BAUDCON3_WUE_SIZE                        equ 0001h
BAUDCON3_WUE_LENGTH                      equ 0001h
BAUDCON3_WUE_MASK                        equ 0002h
BAUDCON3_IREN_POSN                       equ 0002h
BAUDCON3_IREN_POSITION                   equ 0002h
BAUDCON3_IREN_SIZE                       equ 0001h
BAUDCON3_IREN_LENGTH                     equ 0001h
BAUDCON3_IREN_MASK                       equ 0004h
BAUDCON3_BRG16_POSN                      equ 0003h
BAUDCON3_BRG16_POSITION                  equ 0003h
BAUDCON3_BRG16_SIZE                      equ 0001h
BAUDCON3_BRG16_LENGTH                    equ 0001h
BAUDCON3_BRG16_MASK                      equ 0008h
BAUDCON3_TXCKP_POSN                      equ 0004h
BAUDCON3_TXCKP_POSITION                  equ 0004h
BAUDCON3_TXCKP_SIZE                      equ 0001h
BAUDCON3_TXCKP_LENGTH                    equ 0001h
BAUDCON3_TXCKP_MASK                      equ 0010h
BAUDCON3_RXDTP_POSN                      equ 0005h
BAUDCON3_RXDTP_POSITION                  equ 0005h
BAUDCON3_RXDTP_SIZE                      equ 0001h
BAUDCON3_RXDTP_LENGTH                    equ 0001h
BAUDCON3_RXDTP_MASK                      equ 0020h
BAUDCON3_RCIDL_POSN                      equ 0006h
BAUDCON3_RCIDL_POSITION                  equ 0006h
BAUDCON3_RCIDL_SIZE                      equ 0001h
BAUDCON3_RCIDL_LENGTH                    equ 0001h
BAUDCON3_RCIDL_MASK                      equ 0040h
BAUDCON3_ABDOVF_POSN                     equ 0007h
BAUDCON3_ABDOVF_POSITION                 equ 0007h
BAUDCON3_ABDOVF_SIZE                     equ 0001h
BAUDCON3_ABDOVF_LENGTH                   equ 0001h
BAUDCON3_ABDOVF_MASK                     equ 0080h
BAUDCON3_ABDEN3_POSN                     equ 0000h
BAUDCON3_ABDEN3_POSITION                 equ 0000h
BAUDCON3_ABDEN3_SIZE                     equ 0001h
BAUDCON3_ABDEN3_LENGTH                   equ 0001h
BAUDCON3_ABDEN3_MASK                     equ 0001h
BAUDCON3_WUE3_POSN                       equ 0001h
BAUDCON3_WUE3_POSITION                   equ 0001h
BAUDCON3_WUE3_SIZE                       equ 0001h
BAUDCON3_WUE3_LENGTH                     equ 0001h
BAUDCON3_WUE3_MASK                       equ 0002h
BAUDCON3_BRG163_POSN                     equ 0003h
BAUDCON3_BRG163_POSITION                 equ 0003h
BAUDCON3_BRG163_SIZE                     equ 0001h
BAUDCON3_BRG163_LENGTH                   equ 0001h
BAUDCON3_BRG163_MASK                     equ 0008h
BAUDCON3_SCKP3_POSN                      equ 0004h
BAUDCON3_SCKP3_POSITION                  equ 0004h
BAUDCON3_SCKP3_SIZE                      equ 0001h
BAUDCON3_SCKP3_LENGTH                    equ 0001h
BAUDCON3_SCKP3_MASK                      equ 0010h
BAUDCON3_DTRXP3_POSN                     equ 0005h
BAUDCON3_DTRXP3_POSITION                 equ 0005h
BAUDCON3_DTRXP3_SIZE                     equ 0001h
BAUDCON3_DTRXP3_LENGTH                   equ 0001h
BAUDCON3_DTRXP3_MASK                     equ 0020h
BAUDCON3_RCIDL3_POSN                     equ 0006h
BAUDCON3_RCIDL3_POSITION                 equ 0006h
BAUDCON3_RCIDL3_SIZE                     equ 0001h
BAUDCON3_RCIDL3_LENGTH                   equ 0001h
BAUDCON3_RCIDL3_MASK                     equ 0040h
BAUDCON3_ABDOVF3_POSN                    equ 0007h
BAUDCON3_ABDOVF3_POSITION                equ 0007h
BAUDCON3_ABDOVF3_SIZE                    equ 0001h
BAUDCON3_ABDOVF3_LENGTH                  equ 0001h
BAUDCON3_ABDOVF3_MASK                    equ 0080h
BAUDCON3_TXCKP3_POSN                     equ 0004h
BAUDCON3_TXCKP3_POSITION                 equ 0004h
BAUDCON3_TXCKP3_SIZE                     equ 0001h
BAUDCON3_TXCKP3_LENGTH                   equ 0001h
BAUDCON3_TXCKP3_MASK                     equ 0010h
BAUDCON3_RXDTP3_POSN                     equ 0005h
BAUDCON3_RXDTP3_POSITION                 equ 0005h
BAUDCON3_RXDTP3_SIZE                     equ 0001h
BAUDCON3_RXDTP3_LENGTH                   equ 0001h
BAUDCON3_RXDTP3_MASK                     equ 0020h
BAUDCON3_RCMT3_POSN                      equ 0006h
BAUDCON3_RCMT3_POSITION                  equ 0006h
BAUDCON3_RCMT3_SIZE                      equ 0001h
BAUDCON3_RCMT3_LENGTH                    equ 0001h
BAUDCON3_RCMT3_MASK                      equ 0040h

// Register: TXSTA3
#define TXSTA3 TXSTA3
TXSTA3                                   equ 0F2Eh
// bitfield definitions
TXSTA3_TX9D_POSN                         equ 0000h
TXSTA3_TX9D_POSITION                     equ 0000h
TXSTA3_TX9D_SIZE                         equ 0001h
TXSTA3_TX9D_LENGTH                       equ 0001h
TXSTA3_TX9D_MASK                         equ 0001h
TXSTA3_TRMT_POSN                         equ 0001h
TXSTA3_TRMT_POSITION                     equ 0001h
TXSTA3_TRMT_SIZE                         equ 0001h
TXSTA3_TRMT_LENGTH                       equ 0001h
TXSTA3_TRMT_MASK                         equ 0002h
TXSTA3_BRGH_POSN                         equ 0002h
TXSTA3_BRGH_POSITION                     equ 0002h
TXSTA3_BRGH_SIZE                         equ 0001h
TXSTA3_BRGH_LENGTH                       equ 0001h
TXSTA3_BRGH_MASK                         equ 0004h
TXSTA3_SENDB_POSN                        equ 0003h
TXSTA3_SENDB_POSITION                    equ 0003h
TXSTA3_SENDB_SIZE                        equ 0001h
TXSTA3_SENDB_LENGTH                      equ 0001h
TXSTA3_SENDB_MASK                        equ 0008h
TXSTA3_SYNC_POSN                         equ 0004h
TXSTA3_SYNC_POSITION                     equ 0004h
TXSTA3_SYNC_SIZE                         equ 0001h
TXSTA3_SYNC_LENGTH                       equ 0001h
TXSTA3_SYNC_MASK                         equ 0010h
TXSTA3_TXEN_POSN                         equ 0005h
TXSTA3_TXEN_POSITION                     equ 0005h
TXSTA3_TXEN_SIZE                         equ 0001h
TXSTA3_TXEN_LENGTH                       equ 0001h
TXSTA3_TXEN_MASK                         equ 0020h
TXSTA3_TX9_POSN                          equ 0006h
TXSTA3_TX9_POSITION                      equ 0006h
TXSTA3_TX9_SIZE                          equ 0001h
TXSTA3_TX9_LENGTH                        equ 0001h
TXSTA3_TX9_MASK                          equ 0040h
TXSTA3_CSRC_POSN                         equ 0007h
TXSTA3_CSRC_POSITION                     equ 0007h
TXSTA3_CSRC_SIZE                         equ 0001h
TXSTA3_CSRC_LENGTH                       equ 0001h
TXSTA3_CSRC_MASK                         equ 0080h
TXSTA3_TXD83_POSN                        equ 0000h
TXSTA3_TXD83_POSITION                    equ 0000h
TXSTA3_TXD83_SIZE                        equ 0001h
TXSTA3_TXD83_LENGTH                      equ 0001h
TXSTA3_TXD83_MASK                        equ 0001h
TXSTA3_TX8_93_POSN                       equ 0006h
TXSTA3_TX8_93_POSITION                   equ 0006h
TXSTA3_TX8_93_SIZE                       equ 0001h
TXSTA3_TX8_93_LENGTH                     equ 0001h
TXSTA3_TX8_93_MASK                       equ 0040h

// Register: RCSTA3
#define RCSTA3 RCSTA3
RCSTA3                                   equ 0F2Fh
// bitfield definitions
RCSTA3_RX9D_POSN                         equ 0000h
RCSTA3_RX9D_POSITION                     equ 0000h
RCSTA3_RX9D_SIZE                         equ 0001h
RCSTA3_RX9D_LENGTH                       equ 0001h
RCSTA3_RX9D_MASK                         equ 0001h
RCSTA3_OERR_POSN                         equ 0001h
RCSTA3_OERR_POSITION                     equ 0001h
RCSTA3_OERR_SIZE                         equ 0001h
RCSTA3_OERR_LENGTH                       equ 0001h
RCSTA3_OERR_MASK                         equ 0002h
RCSTA3_FERR_POSN                         equ 0002h
RCSTA3_FERR_POSITION                     equ 0002h
RCSTA3_FERR_SIZE                         equ 0001h
RCSTA3_FERR_LENGTH                       equ 0001h
RCSTA3_FERR_MASK                         equ 0004h
RCSTA3_ADDEN_POSN                        equ 0003h
RCSTA3_ADDEN_POSITION                    equ 0003h
RCSTA3_ADDEN_SIZE                        equ 0001h
RCSTA3_ADDEN_LENGTH                      equ 0001h
RCSTA3_ADDEN_MASK                        equ 0008h
RCSTA3_CREN_POSN                         equ 0004h
RCSTA3_CREN_POSITION                     equ 0004h
RCSTA3_CREN_SIZE                         equ 0001h
RCSTA3_CREN_LENGTH                       equ 0001h
RCSTA3_CREN_MASK                         equ 0010h
RCSTA3_SREN_POSN                         equ 0005h
RCSTA3_SREN_POSITION                     equ 0005h
RCSTA3_SREN_SIZE                         equ 0001h
RCSTA3_SREN_LENGTH                       equ 0001h
RCSTA3_SREN_MASK                         equ 0020h
RCSTA3_RX9_POSN                          equ 0006h
RCSTA3_RX9_POSITION                      equ 0006h
RCSTA3_RX9_SIZE                          equ 0001h
RCSTA3_RX9_LENGTH                        equ 0001h
RCSTA3_RX9_MASK                          equ 0040h
RCSTA3_SPEN_POSN                         equ 0007h
RCSTA3_SPEN_POSITION                     equ 0007h
RCSTA3_SPEN_SIZE                         equ 0001h
RCSTA3_SPEN_LENGTH                       equ 0001h
RCSTA3_SPEN_MASK                         equ 0080h
RCSTA3_RCD83_POSN                        equ 0000h
RCSTA3_RCD83_POSITION                    equ 0000h
RCSTA3_RCD83_SIZE                        equ 0001h
RCSTA3_RCD83_LENGTH                      equ 0001h
RCSTA3_RCD83_MASK                        equ 0001h
RCSTA3_RC8_92_POSN                       equ 0006h
RCSTA3_RC8_92_POSITION                   equ 0006h
RCSTA3_RC8_92_SIZE                       equ 0001h
RCSTA3_RC8_92_LENGTH                     equ 0001h
RCSTA3_RC8_92_MASK                       equ 0040h
RCSTA3_RC93_POSN                         equ 0006h
RCSTA3_RC93_POSITION                     equ 0006h
RCSTA3_RC93_SIZE                         equ 0001h
RCSTA3_RC93_LENGTH                       equ 0001h
RCSTA3_RC93_MASK                         equ 0040h

// Register: SPBRGH1
#define SPBRGH1 SPBRGH1
SPBRGH1                                  equ 0F30h
// bitfield definitions
SPBRGH1_SPBRGH1_POSN                     equ 0000h
SPBRGH1_SPBRGH1_POSITION                 equ 0000h
SPBRGH1_SPBRGH1_SIZE                     equ 0008h
SPBRGH1_SPBRGH1_LENGTH                   equ 0008h
SPBRGH1_SPBRGH1_MASK                     equ 00FFh
SPBRGH1_BRG8_POSN                        equ 0000h
SPBRGH1_BRG8_POSITION                    equ 0000h
SPBRGH1_BRG8_SIZE                        equ 0001h
SPBRGH1_BRG8_LENGTH                      equ 0001h
SPBRGH1_BRG8_MASK                        equ 0001h
SPBRGH1_BRG9_POSN                        equ 0001h
SPBRGH1_BRG9_POSITION                    equ 0001h
SPBRGH1_BRG9_SIZE                        equ 0001h
SPBRGH1_BRG9_LENGTH                      equ 0001h
SPBRGH1_BRG9_MASK                        equ 0002h
SPBRGH1_BRG10_POSN                       equ 0002h
SPBRGH1_BRG10_POSITION                   equ 0002h
SPBRGH1_BRG10_SIZE                       equ 0001h
SPBRGH1_BRG10_LENGTH                     equ 0001h
SPBRGH1_BRG10_MASK                       equ 0004h
SPBRGH1_BRG11_POSN                       equ 0003h
SPBRGH1_BRG11_POSITION                   equ 0003h
SPBRGH1_BRG11_SIZE                       equ 0001h
SPBRGH1_BRG11_LENGTH                     equ 0001h
SPBRGH1_BRG11_MASK                       equ 0008h
SPBRGH1_BRG12_POSN                       equ 0004h
SPBRGH1_BRG12_POSITION                   equ 0004h
SPBRGH1_BRG12_SIZE                       equ 0001h
SPBRGH1_BRG12_LENGTH                     equ 0001h
SPBRGH1_BRG12_MASK                       equ 0010h
SPBRGH1_BRG13_POSN                       equ 0005h
SPBRGH1_BRG13_POSITION                   equ 0005h
SPBRGH1_BRG13_SIZE                       equ 0001h
SPBRGH1_BRG13_LENGTH                     equ 0001h
SPBRGH1_BRG13_MASK                       equ 0020h
SPBRGH1_BRG14_POSN                       equ 0006h
SPBRGH1_BRG14_POSITION                   equ 0006h
SPBRGH1_BRG14_SIZE                       equ 0001h
SPBRGH1_BRG14_LENGTH                     equ 0001h
SPBRGH1_BRG14_MASK                       equ 0040h
SPBRGH1_BRG15_POSN                       equ 0007h
SPBRGH1_BRG15_POSITION                   equ 0007h
SPBRGH1_BRG15_SIZE                       equ 0001h
SPBRGH1_BRG15_LENGTH                     equ 0001h
SPBRGH1_BRG15_MASK                       equ 0080h

