GopalSaraf/Practicals/PSDL/include/proc/pic18f67j94.inc
// Register: ADCON1L
#define ADCON1L ADCON1L
ADCON1L                                  equ 0FC0h
// bitfield definitions
ADCON1L_DONE_POSN                        equ 0000h
ADCON1L_DONE_POSITION                    equ 0000h
ADCON1L_DONE_SIZE                        equ 0001h
ADCON1L_DONE_LENGTH                      equ 0001h
ADCON1L_DONE_MASK                        equ 0001h
ADCON1L_SAMP_POSN                        equ 0001h
ADCON1L_SAMP_POSITION                    equ 0001h
ADCON1L_SAMP_SIZE                        equ 0001h
ADCON1L_SAMP_LENGTH                      equ 0001h
ADCON1L_SAMP_MASK                        equ 0002h
ADCON1L_ASAM_POSN                        equ 0002h
ADCON1L_ASAM_POSITION                    equ 0002h
ADCON1L_ASAM_SIZE                        equ 0001h
ADCON1L_ASAM_LENGTH                      equ 0001h
ADCON1L_ASAM_MASK                        equ 0004h
ADCON1L_SSRC_POSN                        equ 0004h
ADCON1L_SSRC_POSITION                    equ 0004h
ADCON1L_SSRC_SIZE                        equ 0004h
ADCON1L_SSRC_LENGTH                      equ 0004h
ADCON1L_SSRC_MASK                        equ 00F0h
ADCON1L_SSRC0_POSN                       equ 0004h
ADCON1L_SSRC0_POSITION                   equ 0004h
ADCON1L_SSRC0_SIZE                       equ 0001h
ADCON1L_SSRC0_LENGTH                     equ 0001h
ADCON1L_SSRC0_MASK                       equ 0010h
ADCON1L_SSRC1_POSN                       equ 0005h
ADCON1L_SSRC1_POSITION                   equ 0005h
ADCON1L_SSRC1_SIZE                       equ 0001h
ADCON1L_SSRC1_LENGTH                     equ 0001h
ADCON1L_SSRC1_MASK                       equ 0020h
ADCON1L_SSRC2_POSN                       equ 0006h
ADCON1L_SSRC2_POSITION                   equ 0006h
ADCON1L_SSRC2_SIZE                       equ 0001h
ADCON1L_SSRC2_LENGTH                     equ 0001h
ADCON1L_SSRC2_MASK                       equ 0040h
ADCON1L_SSRC3_POSN                       equ 0007h
ADCON1L_SSRC3_POSITION                   equ 0007h
ADCON1L_SSRC3_SIZE                       equ 0001h
ADCON1L_SSRC3_LENGTH                     equ 0001h
ADCON1L_SSRC3_MASK                       equ 0080h

// Register: ADCON1H
#define ADCON1H ADCON1H
ADCON1H                                  equ 0FC1h
// bitfield definitions
ADCON1H_FORM_POSN                        equ 0000h
ADCON1H_FORM_POSITION                    equ 0000h
ADCON1H_FORM_SIZE                        equ 0002h
ADCON1H_FORM_LENGTH                      equ 0002h
ADCON1H_FORM_MASK                        equ 0003h
ADCON1H_MODE12_POSN                      equ 0002h
ADCON1H_MODE12_POSITION                  equ 0002h
ADCON1H_MODE12_SIZE                      equ 0001h
ADCON1H_MODE12_LENGTH                    equ 0001h
ADCON1H_MODE12_MASK                      equ 0004h
ADCON1H_ADON_POSN                        equ 0007h
ADCON1H_ADON_POSITION                    equ 0007h
ADCON1H_ADON_SIZE                        equ 0001h
ADCON1H_ADON_LENGTH                      equ 0001h
ADCON1H_ADON_MASK                        equ 0080h
ADCON1H_FORM0_POSN                       equ 0000h
ADCON1H_FORM0_POSITION                   equ 0000h
ADCON1H_FORM0_SIZE                       equ 0001h
ADCON1H_FORM0_LENGTH                     equ 0001h
ADCON1H_FORM0_MASK                       equ 0001h
ADCON1H_FORM1_POSN                       equ 0001h
ADCON1H_FORM1_POSITION                   equ 0001h
ADCON1H_FORM1_SIZE                       equ 0001h
ADCON1H_FORM1_LENGTH                     equ 0001h
ADCON1H_FORM1_MASK                       equ 0002h

// Register: ADCBUF0
#define ADCBUF0 ADCBUF0
ADCBUF0                                  equ 0FC2h

// Register: ADCBUF0L
#define ADCBUF0L ADCBUF0L
ADCBUF0L                                 equ 0FC2h
// bitfield definitions
ADCBUF0L_ADCBUF0L_POSN                   equ 0000h
ADCBUF0L_ADCBUF0L_POSITION               equ 0000h
ADCBUF0L_ADCBUF0L_SIZE                   equ 0008h
ADCBUF0L_ADCBUF0L_LENGTH                 equ 0008h
ADCBUF0L_ADCBUF0L_MASK                   equ 00FFh

// Register: ADCBUF0H
#define ADCBUF0H ADCBUF0H
ADCBUF0H                                 equ 0FC3h
// bitfield definitions
ADCBUF0H_ADCBUF0H_POSN                   equ 0000h
ADCBUF0H_ADCBUF0H_POSITION               equ 0000h
ADCBUF0H_ADCBUF0H_SIZE                   equ 0008h
ADCBUF0H_ADCBUF0H_LENGTH                 equ 0008h
ADCBUF0H_ADCBUF0H_MASK                   equ 00FFh

// Register: CMSTAT
#define CMSTAT CMSTAT
CMSTAT                                   equ 0FC4h
// bitfield definitions
CMSTAT_C1OUT_POSN                        equ 0000h
CMSTAT_C1OUT_POSITION                    equ 0000h
CMSTAT_C1OUT_SIZE                        equ 0001h
CMSTAT_C1OUT_LENGTH                      equ 0001h
CMSTAT_C1OUT_MASK                        equ 0001h
CMSTAT_C2OUT_POSN                        equ 0001h
CMSTAT_C2OUT_POSITION                    equ 0001h
CMSTAT_C2OUT_SIZE                        equ 0001h
CMSTAT_C2OUT_LENGTH                      equ 0001h
CMSTAT_C2OUT_MASK                        equ 0002h
CMSTAT_C3OUT_POSN                        equ 0002h
CMSTAT_C3OUT_POSITION                    equ 0002h
CMSTAT_C3OUT_SIZE                        equ 0001h
CMSTAT_C3OUT_LENGTH                      equ 0001h
CMSTAT_C3OUT_MASK                        equ 0004h

// Register: SSP1CON2
#define SSP1CON2 SSP1CON2
SSP1CON2                                 equ 0FC5h
// bitfield definitions
SSP1CON2_SEN_POSN                        equ 0000h
SSP1CON2_SEN_POSITION                    equ 0000h
SSP1CON2_SEN_SIZE                        equ 0001h
SSP1CON2_SEN_LENGTH                      equ 0001h
SSP1CON2_SEN_MASK                        equ 0001h
SSP1CON2_RSEN_POSN                       equ 0001h
SSP1CON2_RSEN_POSITION                   equ 0001h
SSP1CON2_RSEN_SIZE                       equ 0001h
SSP1CON2_RSEN_LENGTH                     equ 0001h
SSP1CON2_RSEN_MASK                       equ 0002h
SSP1CON2_PEN_POSN                        equ 0002h
SSP1CON2_PEN_POSITION                    equ 0002h
SSP1CON2_PEN_SIZE                        equ 0001h
SSP1CON2_PEN_LENGTH                      equ 0001h
SSP1CON2_PEN_MASK                        equ 0004h
SSP1CON2_RCEN_POSN                       equ 0003h
SSP1CON2_RCEN_POSITION                   equ 0003h
SSP1CON2_RCEN_SIZE                       equ 0001h
SSP1CON2_RCEN_LENGTH                     equ 0001h
SSP1CON2_RCEN_MASK                       equ 0008h
SSP1CON2_ACKEN_POSN                      equ 0004h
SSP1CON2_ACKEN_POSITION                  equ 0004h
SSP1CON2_ACKEN_SIZE                      equ 0001h
SSP1CON2_ACKEN_LENGTH                    equ 0001h
SSP1CON2_ACKEN_MASK                      equ 0010h
SSP1CON2_ACKDT_POSN                      equ 0005h
SSP1CON2_ACKDT_POSITION                  equ 0005h
SSP1CON2_ACKDT_SIZE                      equ 0001h
SSP1CON2_ACKDT_LENGTH                    equ 0001h
SSP1CON2_ACKDT_MASK                      equ 0020h
SSP1CON2_ACKSTAT_POSN                    equ 0006h
SSP1CON2_ACKSTAT_POSITION                equ 0006h
SSP1CON2_ACKSTAT_SIZE                    equ 0001h
SSP1CON2_ACKSTAT_LENGTH                  equ 0001h
SSP1CON2_ACKSTAT_MASK                    equ 0040h
SSP1CON2_GCEN_POSN                       equ 0007h
SSP1CON2_GCEN_POSITION                   equ 0007h
SSP1CON2_GCEN_SIZE                       equ 0001h
SSP1CON2_GCEN_LENGTH                     equ 0001h
SSP1CON2_GCEN_MASK                       equ 0080h
SSP1CON2_ADMSK_POSN                      equ 0001h
SSP1CON2_ADMSK_POSITION                  equ 0001h
SSP1CON2_ADMSK_SIZE                      equ 0005h
SSP1CON2_ADMSK_LENGTH                    equ 0005h
SSP1CON2_ADMSK_MASK                      equ 003Eh
SSP1CON2_ADMSK1_POSN                     equ 0001h
SSP1CON2_ADMSK1_POSITION                 equ 0001h
SSP1CON2_ADMSK1_SIZE                     equ 0001h
SSP1CON2_ADMSK1_LENGTH                   equ 0001h
SSP1CON2_ADMSK1_MASK                     equ 0002h
SSP1CON2_ADMSK2_POSN                     equ 0002h
SSP1CON2_ADMSK2_POSITION                 equ 0002h
SSP1CON2_ADMSK2_SIZE                     equ 0001h
SSP1CON2_ADMSK2_LENGTH                   equ 0001h
SSP1CON2_ADMSK2_MASK                     equ 0004h
SSP1CON2_ADMSK3_POSN                     equ 0003h
SSP1CON2_ADMSK3_POSITION                 equ 0003h
SSP1CON2_ADMSK3_SIZE                     equ 0001h
SSP1CON2_ADMSK3_LENGTH                   equ 0001h
SSP1CON2_ADMSK3_MASK                     equ 0008h
SSP1CON2_ADMSK4_POSN                     equ 0004h
SSP1CON2_ADMSK4_POSITION                 equ 0004h
SSP1CON2_ADMSK4_SIZE                     equ 0001h
SSP1CON2_ADMSK4_LENGTH                   equ 0001h
SSP1CON2_ADMSK4_MASK                     equ 0010h
SSP1CON2_ADMSK5_POSN                     equ 0005h
SSP1CON2_ADMSK5_POSITION                 equ 0005h
SSP1CON2_ADMSK5_SIZE                     equ 0001h
SSP1CON2_ADMSK5_LENGTH                   equ 0001h
SSP1CON2_ADMSK5_MASK                     equ 0020h
SSP1CON2_SEN1_POSN                       equ 0000h
SSP1CON2_SEN1_POSITION                   equ 0000h
SSP1CON2_SEN1_SIZE                       equ 0001h
SSP1CON2_SEN1_LENGTH                     equ 0001h
SSP1CON2_SEN1_MASK                       equ 0001h
SSP1CON2_ADMSK11_POSN                    equ 0001h
SSP1CON2_ADMSK11_POSITION                equ 0001h
SSP1CON2_ADMSK11_SIZE                    equ 0001h
SSP1CON2_ADMSK11_LENGTH                  equ 0001h
SSP1CON2_ADMSK11_MASK                    equ 0002h
SSP1CON2_ADMSK21_POSN                    equ 0002h
SSP1CON2_ADMSK21_POSITION                equ 0002h
SSP1CON2_ADMSK21_SIZE                    equ 0001h
SSP1CON2_ADMSK21_LENGTH                  equ 0001h
SSP1CON2_ADMSK21_MASK                    equ 0004h
SSP1CON2_ADMSK31_POSN                    equ 0003h
SSP1CON2_ADMSK31_POSITION                equ 0003h
SSP1CON2_ADMSK31_SIZE                    equ 0001h
SSP1CON2_ADMSK31_LENGTH                  equ 0001h
SSP1CON2_ADMSK31_MASK                    equ 0008h
SSP1CON2_ACKEN1_POSN                     equ 0004h
SSP1CON2_ACKEN1_POSITION                 equ 0004h
SSP1CON2_ACKEN1_SIZE                     equ 0001h
SSP1CON2_ACKEN1_LENGTH                   equ 0001h
SSP1CON2_ACKEN1_MASK                     equ 0010h
SSP1CON2_ACKDT1_POSN                     equ 0005h
SSP1CON2_ACKDT1_POSITION                 equ 0005h
SSP1CON2_ACKDT1_SIZE                     equ 0001h
SSP1CON2_ACKDT1_LENGTH                   equ 0001h
SSP1CON2_ACKDT1_MASK                     equ 0020h
SSP1CON2_ACKSTAT1_POSN                   equ 0006h
SSP1CON2_ACKSTAT1_POSITION               equ 0006h
SSP1CON2_ACKSTAT1_SIZE                   equ 0001h
SSP1CON2_ACKSTAT1_LENGTH                 equ 0001h
SSP1CON2_ACKSTAT1_MASK                   equ 0040h
SSP1CON2_GCEN1_POSN                      equ 0007h
SSP1CON2_GCEN1_POSITION                  equ 0007h
SSP1CON2_GCEN1_SIZE                      equ 0001h
SSP1CON2_GCEN1_LENGTH                    equ 0001h
SSP1CON2_GCEN1_MASK                      equ 0080h
SSP1CON2_RSEN1_POSN                      equ 0001h
SSP1CON2_RSEN1_POSITION                  equ 0001h
SSP1CON2_RSEN1_SIZE                      equ 0001h
SSP1CON2_RSEN1_LENGTH                    equ 0001h
SSP1CON2_RSEN1_MASK                      equ 0002h
SSP1CON2_PEN1_POSN                       equ 0002h
SSP1CON2_PEN1_POSITION                   equ 0002h
SSP1CON2_PEN1_SIZE                       equ 0001h
SSP1CON2_PEN1_LENGTH                     equ 0001h
SSP1CON2_PEN1_MASK                       equ 0004h
SSP1CON2_RCEN1_POSN                      equ 0003h
SSP1CON2_RCEN1_POSITION                  equ 0003h
SSP1CON2_RCEN1_SIZE                      equ 0001h
SSP1CON2_RCEN1_LENGTH                    equ 0001h
SSP1CON2_RCEN1_MASK                      equ 0008h
SSP1CON2_ADMSK41_POSN                    equ 0004h
SSP1CON2_ADMSK41_POSITION                equ 0004h
SSP1CON2_ADMSK41_SIZE                    equ 0001h
SSP1CON2_ADMSK41_LENGTH                  equ 0001h
SSP1CON2_ADMSK41_MASK                    equ 0010h
SSP1CON2_ADMSK51_POSN                    equ 0005h
SSP1CON2_ADMSK51_POSITION                equ 0005h
SSP1CON2_ADMSK51_SIZE                    equ 0001h
SSP1CON2_ADMSK51_LENGTH                  equ 0001h
SSP1CON2_ADMSK51_MASK                    equ 0020h

// Register: SSP1CON1
#define SSP1CON1 SSP1CON1
SSP1CON1                                 equ 0FC6h
// bitfield definitions
SSP1CON1_SSPM_POSN                       equ 0000h
SSP1CON1_SSPM_POSITION                   equ 0000h
SSP1CON1_SSPM_SIZE                       equ 0004h
SSP1CON1_SSPM_LENGTH                     equ 0004h
SSP1CON1_SSPM_MASK                       equ 000Fh
SSP1CON1_CKP_POSN                        equ 0004h
SSP1CON1_CKP_POSITION                    equ 0004h
SSP1CON1_CKP_SIZE                        equ 0001h
SSP1CON1_CKP_LENGTH                      equ 0001h
SSP1CON1_CKP_MASK                        equ 0010h
SSP1CON1_SSPEN_POSN                      equ 0005h
SSP1CON1_SSPEN_POSITION                  equ 0005h
SSP1CON1_SSPEN_SIZE                      equ 0001h
SSP1CON1_SSPEN_LENGTH                    equ 0001h
SSP1CON1_SSPEN_MASK                      equ 0020h
SSP1CON1_SSPOV_POSN                      equ 0006h
SSP1CON1_SSPOV_POSITION                  equ 0006h
SSP1CON1_SSPOV_SIZE                      equ 0001h
SSP1CON1_SSPOV_LENGTH                    equ 0001h
SSP1CON1_SSPOV_MASK                      equ 0040h
SSP1CON1_WCOL_POSN                       equ 0007h
SSP1CON1_WCOL_POSITION                   equ 0007h
SSP1CON1_WCOL_SIZE                       equ 0001h
SSP1CON1_WCOL_LENGTH                     equ 0001h
SSP1CON1_WCOL_MASK                       equ 0080h
SSP1CON1_SSPM0_POSN                      equ 0000h
SSP1CON1_SSPM0_POSITION                  equ 0000h
SSP1CON1_SSPM0_SIZE                      equ 0001h
SSP1CON1_SSPM0_LENGTH                    equ 0001h
SSP1CON1_SSPM0_MASK                      equ 0001h
SSP1CON1_SSPM1_POSN                      equ 0001h
SSP1CON1_SSPM1_POSITION                  equ 0001h
SSP1CON1_SSPM1_SIZE                      equ 0001h
SSP1CON1_SSPM1_LENGTH                    equ 0001h
SSP1CON1_SSPM1_MASK                      equ 0002h
SSP1CON1_SSPM2_POSN                      equ 0002h
SSP1CON1_SSPM2_POSITION                  equ 0002h
SSP1CON1_SSPM2_SIZE                      equ 0001h
SSP1CON1_SSPM2_LENGTH                    equ 0001h
SSP1CON1_SSPM2_MASK                      equ 0004h
SSP1CON1_SSPM3_POSN                      equ 0003h
SSP1CON1_SSPM3_POSITION                  equ 0003h
SSP1CON1_SSPM3_SIZE                      equ 0001h
SSP1CON1_SSPM3_LENGTH                    equ 0001h
SSP1CON1_SSPM3_MASK                      equ 0008h
SSP1CON1_SSPM01_POSN                     equ 0000h
SSP1CON1_SSPM01_POSITION                 equ 0000h
SSP1CON1_SSPM01_SIZE                     equ 0001h
SSP1CON1_SSPM01_LENGTH                   equ 0001h
SSP1CON1_SSPM01_MASK                     equ 0001h
SSP1CON1_SSPM11_POSN                     equ 0001h
SSP1CON1_SSPM11_POSITION                 equ 0001h
SSP1CON1_SSPM11_SIZE                     equ 0001h
SSP1CON1_SSPM11_LENGTH                   equ 0001h
SSP1CON1_SSPM11_MASK                     equ 0002h
SSP1CON1_SSPM21_POSN                     equ 0002h
SSP1CON1_SSPM21_POSITION                 equ 0002h
SSP1CON1_SSPM21_SIZE                     equ 0001h
SSP1CON1_SSPM21_LENGTH                   equ 0001h
SSP1CON1_SSPM21_MASK                     equ 0004h
SSP1CON1_SSPM31_POSN                     equ 0003h
SSP1CON1_SSPM31_POSITION                 equ 0003h
SSP1CON1_SSPM31_SIZE                     equ 0001h
SSP1CON1_SSPM31_LENGTH                   equ 0001h
SSP1CON1_SSPM31_MASK                     equ 0008h
SSP1CON1_CKP1_POSN                       equ 0004h
SSP1CON1_CKP1_POSITION                   equ 0004h
SSP1CON1_CKP1_SIZE                       equ 0001h
SSP1CON1_CKP1_LENGTH                     equ 0001h
SSP1CON1_CKP1_MASK                       equ 0010h
SSP1CON1_SSPEN1_POSN                     equ 0005h
SSP1CON1_SSPEN1_POSITION                 equ 0005h
SSP1CON1_SSPEN1_SIZE                     equ 0001h
SSP1CON1_SSPEN1_LENGTH                   equ 0001h
SSP1CON1_SSPEN1_MASK                     equ 0020h
SSP1CON1_SSPOV1_POSN                     equ 0006h
SSP1CON1_SSPOV1_POSITION                 equ 0006h
SSP1CON1_SSPOV1_SIZE                     equ 0001h
SSP1CON1_SSPOV1_LENGTH                   equ 0001h
SSP1CON1_SSPOV1_MASK                     equ 0040h
SSP1CON1_WCOL1_POSN                      equ 0007h
SSP1CON1_WCOL1_POSITION                  equ 0007h
SSP1CON1_WCOL1_SIZE                      equ 0001h
SSP1CON1_WCOL1_LENGTH                    equ 0001h
SSP1CON1_WCOL1_MASK                      equ 0080h

