GopalSaraf/Practicals/PSDL/include/proc/pic18f67j94.inc
// Register: SSP1BUF
#define SSP1BUF SSP1BUF
SSP1BUF                                  equ 0FC9h
// bitfield definitions
SSP1BUF_SSPBUF_POSN                      equ 0000h
SSP1BUF_SSPBUF_POSITION                  equ 0000h
SSP1BUF_SSPBUF_SIZE                      equ 0008h
SSP1BUF_SSPBUF_LENGTH                    equ 0008h
SSP1BUF_SSPBUF_MASK                      equ 00FFh

// Register: T2CON
#define T2CON T2CON
T2CON                                    equ 0FCAh
// bitfield definitions
T2CON_T2CKPS_POSN                        equ 0000h
T2CON_T2CKPS_POSITION                    equ 0000h
T2CON_T2CKPS_SIZE                        equ 0002h
T2CON_T2CKPS_LENGTH                      equ 0002h
T2CON_T2CKPS_MASK                        equ 0003h
T2CON_TMR2ON_POSN                        equ 0002h
T2CON_TMR2ON_POSITION                    equ 0002h
T2CON_TMR2ON_SIZE                        equ 0001h
T2CON_TMR2ON_LENGTH                      equ 0001h
T2CON_TMR2ON_MASK                        equ 0004h
T2CON_T2OUTPS_POSN                       equ 0003h
T2CON_T2OUTPS_POSITION                   equ 0003h
T2CON_T2OUTPS_SIZE                       equ 0004h
T2CON_T2OUTPS_LENGTH                     equ 0004h
T2CON_T2OUTPS_MASK                       equ 0078h
T2CON_T2CKPS0_POSN                       equ 0000h
T2CON_T2CKPS0_POSITION                   equ 0000h
T2CON_T2CKPS0_SIZE                       equ 0001h
T2CON_T2CKPS0_LENGTH                     equ 0001h
T2CON_T2CKPS0_MASK                       equ 0001h
T2CON_T2CKPS1_POSN                       equ 0001h
T2CON_T2CKPS1_POSITION                   equ 0001h
T2CON_T2CKPS1_SIZE                       equ 0001h
T2CON_T2CKPS1_LENGTH                     equ 0001h
T2CON_T2CKPS1_MASK                       equ 0002h
T2CON_T2OUTPS0_POSN                      equ 0003h
T2CON_T2OUTPS0_POSITION                  equ 0003h
T2CON_T2OUTPS0_SIZE                      equ 0001h
T2CON_T2OUTPS0_LENGTH                    equ 0001h
T2CON_T2OUTPS0_MASK                      equ 0008h
T2CON_T2OUTPS1_POSN                      equ 0004h
T2CON_T2OUTPS1_POSITION                  equ 0004h
T2CON_T2OUTPS1_SIZE                      equ 0001h
T2CON_T2OUTPS1_LENGTH                    equ 0001h
T2CON_T2OUTPS1_MASK                      equ 0010h
T2CON_T2OUTPS2_POSN                      equ 0005h
T2CON_T2OUTPS2_POSITION                  equ 0005h
T2CON_T2OUTPS2_SIZE                      equ 0001h
T2CON_T2OUTPS2_LENGTH                    equ 0001h
T2CON_T2OUTPS2_MASK                      equ 0020h
T2CON_T2OUTPS3_POSN                      equ 0006h
T2CON_T2OUTPS3_POSITION                  equ 0006h
T2CON_T2OUTPS3_SIZE                      equ 0001h
T2CON_T2OUTPS3_LENGTH                    equ 0001h
T2CON_T2OUTPS3_MASK                      equ 0040h

// Register: PR2
#define PR2 PR2
PR2                                      equ 0FCBh
// bitfield definitions
PR2_PR2_POSN                             equ 0000h
PR2_PR2_POSITION                         equ 0000h
PR2_PR2_SIZE                             equ 0008h
PR2_PR2_LENGTH                           equ 0008h
PR2_PR2_MASK                             equ 00FFh
PR2_EBDIS_POSN                           equ 0007h
PR2_EBDIS_POSITION                       equ 0007h
PR2_EBDIS_SIZE                           equ 0001h
PR2_EBDIS_LENGTH                         equ 0001h
PR2_EBDIS_MASK                           equ 0080h
PR2_WAIT0_POSN                           equ 0004h
PR2_WAIT0_POSITION                       equ 0004h
PR2_WAIT0_SIZE                           equ 0001h
PR2_WAIT0_LENGTH                         equ 0001h
PR2_WAIT0_MASK                           equ 0010h
PR2_WAIT1_POSN                           equ 0005h
PR2_WAIT1_POSITION                       equ 0005h
PR2_WAIT1_SIZE                           equ 0001h
PR2_WAIT1_LENGTH                         equ 0001h
PR2_WAIT1_MASK                           equ 0020h
PR2_WM0_POSN                             equ 0000h
PR2_WM0_POSITION                         equ 0000h
PR2_WM0_SIZE                             equ 0001h
PR2_WM0_LENGTH                           equ 0001h
PR2_WM0_MASK                             equ 0001h
PR2_WM1_POSN                             equ 0001h
PR2_WM1_POSITION                         equ 0001h
PR2_WM1_SIZE                             equ 0001h
PR2_WM1_LENGTH                           equ 0001h
PR2_WM1_MASK                             equ 0002h

// Register: TMR2
#define TMR2 TMR2
TMR2                                     equ 0FCCh
// bitfield definitions
TMR2_TMR2_POSN                           equ 0000h
TMR2_TMR2_POSITION                       equ 0000h
TMR2_TMR2_SIZE                           equ 0008h
TMR2_TMR2_LENGTH                         equ 0008h
TMR2_TMR2_MASK                           equ 00FFh

// Register: T1CON
#define T1CON T1CON
T1CON                                    equ 0FCDh
// bitfield definitions
T1CON_NOT_T1SYNC_POSN                    equ 0002h
T1CON_NOT_T1SYNC_POSITION                equ 0002h
T1CON_NOT_T1SYNC_SIZE                    equ 0001h
T1CON_NOT_T1SYNC_LENGTH                  equ 0001h
T1CON_NOT_T1SYNC_MASK                    equ 0004h
T1CON_TMR1ON_POSN                        equ 0000h
T1CON_TMR1ON_POSITION                    equ 0000h
T1CON_TMR1ON_SIZE                        equ 0001h
T1CON_TMR1ON_LENGTH                      equ 0001h
T1CON_TMR1ON_MASK                        equ 0001h
T1CON_RD16_POSN                          equ 0001h
T1CON_RD16_POSITION                      equ 0001h
T1CON_RD16_SIZE                          equ 0001h
T1CON_RD16_LENGTH                        equ 0001h
T1CON_RD16_MASK                          equ 0002h
T1CON_nT1SYNC_POSN                       equ 0002h
T1CON_nT1SYNC_POSITION                   equ 0002h
T1CON_nT1SYNC_SIZE                       equ 0001h
T1CON_nT1SYNC_LENGTH                     equ 0001h
T1CON_nT1SYNC_MASK                       equ 0004h
T1CON_SOSCEN_POSN                        equ 0003h
T1CON_SOSCEN_POSITION                    equ 0003h
T1CON_SOSCEN_SIZE                        equ 0001h
T1CON_SOSCEN_LENGTH                      equ 0001h
T1CON_SOSCEN_MASK                        equ 0008h
T1CON_TCKPS_POSN                         equ 0004h
T1CON_TCKPS_POSITION                     equ 0004h
T1CON_TCKPS_SIZE                         equ 0002h
T1CON_TCKPS_LENGTH                       equ 0002h
T1CON_TCKPS_MASK                         equ 0030h
T1CON_TMR1CS_POSN                        equ 0006h
T1CON_TMR1CS_POSITION                    equ 0006h
T1CON_TMR1CS_SIZE                        equ 0002h
T1CON_TMR1CS_LENGTH                      equ 0002h
T1CON_TMR1CS_MASK                        equ 00C0h
T1CON_T1CKPS0_POSN                       equ 0004h
T1CON_T1CKPS0_POSITION                   equ 0004h
T1CON_T1CKPS0_SIZE                       equ 0001h
T1CON_T1CKPS0_LENGTH                     equ 0001h
T1CON_T1CKPS0_MASK                       equ 0010h
T1CON_T1CKPS1_POSN                       equ 0005h
T1CON_T1CKPS1_POSITION                   equ 0005h
T1CON_T1CKPS1_SIZE                       equ 0001h
T1CON_T1CKPS1_LENGTH                     equ 0001h
T1CON_T1CKPS1_MASK                       equ 0020h
T1CON_TMR1CS0_POSN                       equ 0006h
T1CON_TMR1CS0_POSITION                   equ 0006h
T1CON_TMR1CS0_SIZE                       equ 0001h
T1CON_TMR1CS0_LENGTH                     equ 0001h
T1CON_TMR1CS0_MASK                       equ 0040h
T1CON_TMR1CS1_POSN                       equ 0007h
T1CON_TMR1CS1_POSITION                   equ 0007h
T1CON_TMR1CS1_SIZE                       equ 0001h
T1CON_TMR1CS1_LENGTH                     equ 0001h
T1CON_TMR1CS1_MASK                       equ 0080h
T1CON_RD161_POSN                         equ 0001h
T1CON_RD161_POSITION                     equ 0001h
T1CON_RD161_SIZE                         equ 0001h
T1CON_RD161_LENGTH                       equ 0001h
T1CON_RD161_MASK                         equ 0002h
T1CON_SOSCEN1_POSN                       equ 0003h
T1CON_SOSCEN1_POSITION                   equ 0003h
T1CON_SOSCEN1_SIZE                       equ 0001h
T1CON_SOSCEN1_LENGTH                     equ 0001h
T1CON_SOSCEN1_MASK                       equ 0008h
T1CON_T1RD16_POSN                        equ 0007h
T1CON_T1RD16_POSITION                    equ 0007h
T1CON_T1RD16_SIZE                        equ 0001h
T1CON_T1RD16_LENGTH                      equ 0001h
T1CON_T1RD16_MASK                        equ 0080h
T1CON_T1OSCEN_POSN                       equ 0003h
T1CON_T1OSCEN_POSITION                   equ 0003h
T1CON_T1OSCEN_SIZE                       equ 0001h
T1CON_T1OSCEN_LENGTH                     equ 0001h
T1CON_T1OSCEN_MASK                       equ 0008h

// Register: TMR1
#define TMR1 TMR1
TMR1                                     equ 0FCEh

// Register: TMR1L
#define TMR1L TMR1L
TMR1L                                    equ 0FCEh
// bitfield definitions
TMR1L_TMR1L_POSN                         equ 0000h
TMR1L_TMR1L_POSITION                     equ 0000h
TMR1L_TMR1L_SIZE                         equ 0008h
TMR1L_TMR1L_LENGTH                       equ 0008h
TMR1L_TMR1L_MASK                         equ 00FFh

// Register: TMR1H
#define TMR1H TMR1H
TMR1H                                    equ 0FCFh
// bitfield definitions
TMR1H_TMR1H_POSN                         equ 0000h
TMR1H_TMR1H_POSITION                     equ 0000h
TMR1H_TMR1H_SIZE                         equ 0008h
TMR1H_TMR1H_LENGTH                       equ 0008h
TMR1H_TMR1H_MASK                         equ 00FFh

// Register: RCON
#define RCON RCON
RCON                                     equ 0FD0h
// bitfield definitions
RCON_NOT_BOR_POSN                        equ 0000h
RCON_NOT_BOR_POSITION                    equ 0000h
RCON_NOT_BOR_SIZE                        equ 0001h
RCON_NOT_BOR_LENGTH                      equ 0001h
RCON_NOT_BOR_MASK                        equ 0001h
RCON_NOT_POR_POSN                        equ 0001h
RCON_NOT_POR_POSITION                    equ 0001h
RCON_NOT_POR_SIZE                        equ 0001h
RCON_NOT_POR_LENGTH                      equ 0001h
RCON_NOT_POR_MASK                        equ 0002h
RCON_NOT_PD_POSN                         equ 0002h
RCON_NOT_PD_POSITION                     equ 0002h
RCON_NOT_PD_SIZE                         equ 0001h
RCON_NOT_PD_LENGTH                       equ 0001h
RCON_NOT_PD_MASK                         equ 0004h
RCON_NOT_TO_POSN                         equ 0003h
RCON_NOT_TO_POSITION                     equ 0003h
RCON_NOT_TO_SIZE                         equ 0001h
RCON_NOT_TO_LENGTH                       equ 0001h
RCON_NOT_TO_MASK                         equ 0008h
RCON_NOT_RI_POSN                         equ 0004h
RCON_NOT_RI_POSITION                     equ 0004h
RCON_NOT_RI_SIZE                         equ 0001h
RCON_NOT_RI_LENGTH                       equ 0001h
RCON_NOT_RI_MASK                         equ 0010h
RCON_NOT_CM_POSN                         equ 0005h
RCON_NOT_CM_POSITION                     equ 0005h
RCON_NOT_CM_SIZE                         equ 0001h
RCON_NOT_CM_LENGTH                       equ 0001h
RCON_NOT_CM_MASK                         equ 0020h
RCON_nBOR_POSN                           equ 0000h
RCON_nBOR_POSITION                       equ 0000h
RCON_nBOR_SIZE                           equ 0001h
RCON_nBOR_LENGTH                         equ 0001h
RCON_nBOR_MASK                           equ 0001h
RCON_nPOR_POSN                           equ 0001h
RCON_nPOR_POSITION                       equ 0001h
RCON_nPOR_SIZE                           equ 0001h
RCON_nPOR_LENGTH                         equ 0001h
RCON_nPOR_MASK                           equ 0002h
RCON_nPD_POSN                            equ 0002h
RCON_nPD_POSITION                        equ 0002h
RCON_nPD_SIZE                            equ 0001h
RCON_nPD_LENGTH                          equ 0001h
RCON_nPD_MASK                            equ 0004h
RCON_nTO_POSN                            equ 0003h
RCON_nTO_POSITION                        equ 0003h
RCON_nTO_SIZE                            equ 0001h
RCON_nTO_LENGTH                          equ 0001h
RCON_nTO_MASK                            equ 0008h
RCON_nRI_POSN                            equ 0004h
RCON_nRI_POSITION                        equ 0004h
RCON_nRI_SIZE                            equ 0001h
RCON_nRI_LENGTH                          equ 0001h
RCON_nRI_MASK                            equ 0010h
RCON_nCM_POSN                            equ 0005h
RCON_nCM_POSITION                        equ 0005h
RCON_nCM_SIZE                            equ 0001h
RCON_nCM_LENGTH                          equ 0001h
RCON_nCM_MASK                            equ 0020h
RCON_IPEN_POSN                           equ 0007h
RCON_IPEN_POSITION                       equ 0007h
RCON_IPEN_SIZE                           equ 0001h
RCON_IPEN_LENGTH                         equ 0001h
RCON_IPEN_MASK                           equ 0080h
RCON_BOR_POSN                            equ 0000h
RCON_BOR_POSITION                        equ 0000h
RCON_BOR_SIZE                            equ 0001h
RCON_BOR_LENGTH                          equ 0001h
RCON_BOR_MASK                            equ 0001h
RCON_POR_POSN                            equ 0001h
RCON_POR_POSITION                        equ 0001h
RCON_POR_SIZE                            equ 0001h
RCON_POR_LENGTH                          equ 0001h
RCON_POR_MASK                            equ 0002h
RCON_PD_POSN                             equ 0002h
RCON_PD_POSITION                         equ 0002h
RCON_PD_SIZE                             equ 0001h
RCON_PD_LENGTH                           equ 0001h
RCON_PD_MASK                             equ 0004h
RCON_TO_POSN                             equ 0003h
RCON_TO_POSITION                         equ 0003h
RCON_TO_SIZE                             equ 0001h
RCON_TO_LENGTH                           equ 0001h
RCON_TO_MASK                             equ 0008h
RCON_RI_POSN                             equ 0004h
RCON_RI_POSITION                         equ 0004h
RCON_RI_SIZE                             equ 0001h
RCON_RI_LENGTH                           equ 0001h
RCON_RI_MASK                             equ 0010h
RCON_CM_POSN                             equ 0005h
RCON_CM_POSITION                         equ 0005h
RCON_CM_SIZE                             equ 0001h
RCON_CM_LENGTH                           equ 0001h
RCON_CM_MASK                             equ 0020h

// Register: IOCF
#define IOCF IOCF
IOCF                                     equ 0FD1h
// bitfield definitions
IOCF_IOCF0_POSN                          equ 0000h
IOCF_IOCF0_POSITION                      equ 0000h
IOCF_IOCF0_SIZE                          equ 0001h
IOCF_IOCF0_LENGTH                        equ 0001h
IOCF_IOCF0_MASK                          equ 0001h
IOCF_IOCF1_POSN                          equ 0001h
IOCF_IOCF1_POSITION                      equ 0001h
IOCF_IOCF1_SIZE                          equ 0001h
IOCF_IOCF1_LENGTH                        equ 0001h
IOCF_IOCF1_MASK                          equ 0002h
IOCF_IOCF2_POSN                          equ 0002h
IOCF_IOCF2_POSITION                      equ 0002h
IOCF_IOCF2_SIZE                          equ 0001h
IOCF_IOCF2_LENGTH                        equ 0001h
IOCF_IOCF2_MASK                          equ 0004h
IOCF_IOCF3_POSN                          equ 0003h
IOCF_IOCF3_POSITION                      equ 0003h
IOCF_IOCF3_SIZE                          equ 0001h
IOCF_IOCF3_LENGTH                        equ 0001h
IOCF_IOCF3_MASK                          equ 0008h
IOCF_IOCF4_POSN                          equ 0004h
IOCF_IOCF4_POSITION                      equ 0004h
IOCF_IOCF4_SIZE                          equ 0001h
IOCF_IOCF4_LENGTH                        equ 0001h
IOCF_IOCF4_MASK                          equ 0010h
IOCF_IOCF5_POSN                          equ 0005h
IOCF_IOCF5_POSITION                      equ 0005h
IOCF_IOCF5_SIZE                          equ 0001h
IOCF_IOCF5_LENGTH                        equ 0001h
IOCF_IOCF5_MASK                          equ 0020h
IOCF_IOCF6_POSN                          equ 0006h
IOCF_IOCF6_POSITION                      equ 0006h
IOCF_IOCF6_SIZE                          equ 0001h
IOCF_IOCF6_LENGTH                        equ 0001h
IOCF_IOCF6_MASK                          equ 0040h
IOCF_IOCF7_POSN                          equ 0007h
IOCF_IOCF7_POSITION                      equ 0007h
IOCF_IOCF7_SIZE                          equ 0001h
IOCF_IOCF7_LENGTH                        equ 0001h
IOCF_IOCF7_MASK                          equ 0080h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 0FD2h
// bitfield definitions
IPR5_TMR4IP_POSN                         equ 0000h
IPR5_TMR4IP_POSITION                     equ 0000h
IPR5_TMR4IP_SIZE                         equ 0001h
IPR5_TMR4IP_LENGTH                       equ 0001h
IPR5_TMR4IP_MASK                         equ 0001h
IPR5_TMR5IP_POSN                         equ 0001h
IPR5_TMR5IP_POSITION                     equ 0001h
IPR5_TMR5IP_SIZE                         equ 0001h
IPR5_TMR5IP_LENGTH                       equ 0001h
IPR5_TMR5IP_MASK                         equ 0002h
IPR5_TMR6IP_POSN                         equ 0002h
IPR5_TMR6IP_POSITION                     equ 0002h
IPR5_TMR6IP_SIZE                         equ 0001h
IPR5_TMR6IP_LENGTH                       equ 0001h
IPR5_TMR6IP_MASK                         equ 0004h
IPR5_TMR8IP_POSN                         equ 0004h
IPR5_TMR8IP_POSITION                     equ 0004h
IPR5_TMR8IP_SIZE                         equ 0001h
IPR5_TMR8IP_LENGTH                       equ 0001h
IPR5_TMR8IP_MASK                         equ 0010h
IPR5_ACTLOCKIP_POSN                      equ 0005h
IPR5_ACTLOCKIP_POSITION                  equ 0005h
IPR5_ACTLOCKIP_SIZE                      equ 0001h
IPR5_ACTLOCKIP_LENGTH                    equ 0001h
IPR5_ACTLOCKIP_MASK                      equ 0020h
IPR5_ACTORSIP_POSN                       equ 0006h
IPR5_ACTORSIP_POSITION                   equ 0006h
IPR5_ACTORSIP_SIZE                       equ 0001h
IPR5_ACTORSIP_LENGTH                     equ 0001h
IPR5_ACTORSIP_MASK                       equ 0040h
IPR5_CCH05_POSN                          equ 0000h
IPR5_CCH05_POSITION                      equ 0000h
IPR5_CCH05_SIZE                          equ 0001h
IPR5_CCH05_LENGTH                        equ 0001h
IPR5_CCH05_MASK                          equ 0001h
IPR5_CCH15_POSN                          equ 0001h
IPR5_CCH15_POSITION                      equ 0001h
IPR5_CCH15_SIZE                          equ 0001h
IPR5_CCH15_LENGTH                        equ 0001h
IPR5_CCH15_MASK                          equ 0002h
IPR5_EVPOL15_POSN                        equ 0004h
IPR5_EVPOL15_POSITION                    equ 0004h
IPR5_EVPOL15_SIZE                        equ 0001h
IPR5_EVPOL15_LENGTH                      equ 0001h
IPR5_EVPOL15_MASK                        equ 0010h

// Register: OSCCON
#define OSCCON OSCCON
OSCCON                                   equ 0FD3h
// bitfield definitions
OSCCON_NOSC_POSN                         equ 0000h
OSCCON_NOSC_POSITION                     equ 0000h
OSCCON_NOSC_SIZE                         equ 0003h
OSCCON_NOSC_LENGTH                       equ 0003h
OSCCON_NOSC_MASK                         equ 0007h
OSCCON_COSC_POSN                         equ 0004h
OSCCON_COSC_POSITION                     equ 0004h
OSCCON_COSC_SIZE                         equ 0003h
OSCCON_COSC_LENGTH                       equ 0003h
OSCCON_COSC_MASK                         equ 0070h
OSCCON_IDLEN_POSN                        equ 0007h
OSCCON_IDLEN_POSITION                    equ 0007h
OSCCON_IDLEN_SIZE                        equ 0001h
OSCCON_IDLEN_LENGTH                      equ 0001h
OSCCON_IDLEN_MASK                        equ 0080h
OSCCON_NOSC0_POSN                        equ 0000h
OSCCON_NOSC0_POSITION                    equ 0000h
OSCCON_NOSC0_SIZE                        equ 0001h
OSCCON_NOSC0_LENGTH                      equ 0001h
OSCCON_NOSC0_MASK                        equ 0001h
OSCCON_NOSC1_POSN                        equ 0001h
OSCCON_NOSC1_POSITION                    equ 0001h
OSCCON_NOSC1_SIZE                        equ 0001h
OSCCON_NOSC1_LENGTH                      equ 0001h
OSCCON_NOSC1_MASK                        equ 0002h
OSCCON_NOSC2_POSN                        equ 0002h
OSCCON_NOSC2_POSITION                    equ 0002h
OSCCON_NOSC2_SIZE                        equ 0001h
OSCCON_NOSC2_LENGTH                      equ 0001h
OSCCON_NOSC2_MASK                        equ 0004h
OSCCON_COSC0_POSN                        equ 0004h
OSCCON_COSC0_POSITION                    equ 0004h
OSCCON_COSC0_SIZE                        equ 0001h
OSCCON_COSC0_LENGTH                      equ 0001h
OSCCON_COSC0_MASK                        equ 0010h
OSCCON_COSC1_POSN                        equ 0005h
OSCCON_COSC1_POSITION                    equ 0005h
OSCCON_COSC1_SIZE                        equ 0001h
OSCCON_COSC1_LENGTH                      equ 0001h
OSCCON_COSC1_MASK                        equ 0020h
OSCCON_COSC2_POSN                        equ 0006h
OSCCON_COSC2_POSITION                    equ 0006h
OSCCON_COSC2_SIZE                        equ 0001h
OSCCON_COSC2_LENGTH                      equ 0001h
OSCCON_COSC2_MASK                        equ 0040h
OSCCON_SCS_POSN                          equ 0000h
OSCCON_SCS_POSITION                      equ 0000h
OSCCON_SCS_SIZE                          equ 0001h
OSCCON_SCS_LENGTH                        equ 0001h
OSCCON_SCS_MASK                          equ 0001h

